<a href="https://colab.research.google.com/github/ssanchezgoe/python_db/blob/master/SQL_RDB_101_ssanchez.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#**MODULO 2: Bases de datos**
#**Notebook: SQL**
#**CLASE 1: Secciones A, B, C y G**

#**A. SQL y Bases de datos relacionales**

##**1. ¿Qué es SQL las bases de datos relacionales?**

**¿Qué es SQL?**

SQL es un lenguaje usado para las bases de datos relacionales para consultar y obtener datos de las bases de datos.

SQL es el acrónimo en inglés de **Structured english Query Language**, o, **Lenguaje estructurado de consulta**. De esta forma, SQL es un lenguaje usado usado en una base de datos para la consulta de datos.

**¿Que son los Datos?**

Los datos corresponden a colecciones de hechos en forma de:

- Palabras: que pueden representar categorias, reseñas, etc.
- Números: Como la edad de una persona, el ingreso mensual, etc.
- Imágnes.
- Etc.

Tenemos que tener en cuenta que **los datos representan el activo más importante para cualquier negocio**. Existen varios ejemplos del uso de datos por parte de compañias:

- Los bancos, por ejemplo, guardan de cada uno de nosotros un perfil con datos como el nombre, la dirección de residencia, el número de móvil, el número de cuenta, etc.

- Ciertas compañias de telecomunicaciones pueden almacenar datos de personas como su cupo de endeudamiento, el estrato en el que viven, un estimado de ingresos mensuales, etc.

Con el fin de tener acceso a estos datos de forma fácil y segura es que se crean las bases de datos.

**¿Qué es una base de datos?**

Una base de datos es un repositorio que almacena información de forma estructurada o no. Corresponde entonces, a un programa que almacena datos. Una base de datos proporciona, a su vez, las funcionalidades necesarias para **adicionar, modificar y consultar los datos**. 

Existen diferentes tipos de bases de datos que tienen como fin satisfacer diferentes necesidades, de tal forma que pueden ser guardadas de varias formas. 

**Bases de datos relacionales**

En el caso de tener diferentes datos almacenados en una forma tabular, organizados en tablas, como en el caso de una hoja de cálculo, hablamos de una báse de datos relacional. La siguiente figura ilustra un elemento de este tipo de base de datos, con el que muchos de ustedes estarán familiarizados.

<center>
    <img height="200px" src="https://github.com/ssanchezgoe/flask_vscode_tutorial/blob/master/imagenes/tabla_ejemplo.png?raw=true" />
</center>

Cada una de las columnas contienen propiedades sobre los ítems como el Nombre, la Ciudad, la Edad, el e-mail y el País. 

Definimos, entonces, a una tabla como una colección de elementos relacionados, como una lista de empleados, o una lista de autores de artículos, etc. En la bases de datos relacionales podemos formar relaciones entre tablas. Así, **una base de datos es un repocitorio de datos**.

Respecto a la funcionalidad operativa de la base de datos, definimos a un **sistema de gestión de bases de datos** (en inglés DBMS - Data Base Managment System). A menudo, al DBMS se le denomina como *base de datos*, *servidor de base de datos*, *servidor de datos* o *gestor de base de datos*. En el caso de una base de datos relacional, se le conoce, en inglés, como RDBMS (Relational Data Base Managment System). 

---
**RDBMS:** Conjunto de herramientas de software que controla aspectos de los datos como acceso, organización y almacenamiento.

Algunos ejemplos de *RDBMS* son:

- MySQL
- Oracle
- DB2 Express-C
---

Para la mayoria de personas que usan una base de datos, existen cinco comandos de uso común los cuales son:

- Crear tabla
- Insertar datos 
- Seleccionar datos de una tabla
- Actualizar datos de una tabla
- Borrar datos de una tabla

que representan los pilares en SQL y las bases de datos relacionales.

## **2. Información y Modelos de datos**

Objetivos de la unidad:

1. Descripcion de diferencias entre modelo de información y modelo de datos
2. Explicación de la ventaja de un modelo relacional.
3. Descripción de la diferencia entre una entidad y un atributo.

###**Modelo de información vs Modelo de datos**

Un **modelo de información** es una representanción abstracta y formal de **entidades** que incluye a sus propiedades, relaciones y operaciones que pueden ser realizadas en estas. Las **entidades** que son modeladas pueden provenir del mundo real, como una librería.

Los **modelos de información** y los **modelos de datos** son diferentes y sirven para propósitos diferentes. El **modelo de información** se encuentra más a un nivel conceptual que define las relaciones entre los objetos. Los **modelos de datos** se definen a un nivel más concreto, son específicos e incluye detalles específicos. Un modelo de datos es un cianotipo d cualquier sistema de bases de datos. El más popular es el **modelo de datos de tipo jerárquico**, usado para mostrar organigramas. 

Como se muestra en la siguiente figura, el modelo jerárquico organiza sus datos usando una estructura de árbol. La raíz del arbol es el **nodo padre** segido de los **nodos hijos**, Un nodo hijo no puede tener más de un padre, no obstante, un nodo padre puede tener varios nodos hijos.

<center>
    <img height="330px" src="https://github.com/ssanchezgoe/flask_vscode_tutorial/blob/master/imagenes/organigrama-de-una-empresa.png?raw=true
" />
</center>

###**Modelo de datos Relacional o Modelo relacional**

El **modelo relacional** es el modelo de datos más usado en bases de datos ya que este modelo permite la indepencencia entre datos. Como se ha mencionado anteriormente, los datos son almacenados en una estructura simple, como una tabla. Esta estructura proporciona una independencia lógida de los datos, una independencia física, y una independencia en su almacenamiento físico.

###**Modelo de datos entidad-relación**

Un modelo de datos **entidad-relación**, o modelo de datos ER, es una alternativa al modelo. Este modelo postula que una base de datos debe ser pensada como una colección de entidades. En lugar de utilizarse este modelo como un modelo de datos en si mismo, el modelo ER se usa como herramienta para diseñar base de datos relacionales. En el modelo ER, las entidades son objetos que existen independientes de cualquier otra entidad en la base de datos. Es sencillo converti un diagrama de ER en una colección de tablas. Los componentes básicos de un diagrama de ER son **entidades** y **atributos**. Las entidades tienen atributos que corresponden a elementos de datos que caracterizan a la entidad, es decir que los atributos nos brindan más información de la entidad. En un diagrama ER, las entidades se dibujan como rectángulos y los atributos como ovalos. Las entidades pueden ser un sustantivo (persona, animal, lugar o cosa). En la siguiente figura se ilustra diagrama ER de forma general.


<center>
    <img height="330px" src="https://github.com/ssanchezgoe/flask_vscode_tutorial/blob/master/imagenes/ERC.png?raw=true
" />
</center>

Para convertir un modelo ER a una tabla, las entidades corresponderían al nombre de la tabla, y los atributos a la columna, como se especifica en la figura. En el caso concreto de una base de datos de casas, un diagrama ER tendría la siguiente siguiente forma.

<center>
    <img height="330px" src="https://github.com/ssanchezgoe/flask_vscode_tutorial/blob/master/imagenes/ERD_casa.png?raw=true" />
</center>

En el proceso de construcción de una base de datos de casas, que puede poseer una inmoviliaria, por ejemplo, lo primero sería identificar cada una de las entidades, y cada una de las entidades deben estar compuestas por sus respectivos atributos. Cada una de las entidades se convertirá entonces en una tabla:


<center>
    <img height="500px" src="https://github.com/ssanchezgoe/flask_vscode_tutorial/blob/master/imagenes/ERD_inmoviliaria.png?raw=true" />
</center>

##**3. Tipos de relaciones**

En esta sección se estudiarán los tipos de **relaciones existentes entre las entidades**. Al final de esta sección, estará habrá adquirido competencias en:

- Descripción de los elementos constitutivos de una relación.
- Compresión de los simbolos usados en un conjunto de relaciones.
- Comprensión de las diferencias de las relaciones uno-contr-uno o varios-contra-varios.

###**Building Blocks - Elementos constitutivos en las relaciones**

Los elementos constitutivos (Building Blocks) en una relación están dados por

- Entidades

  <center>
    <img height="80px" src="https://github.com/ssanchezgoe/flask_vscode_tutorial/blob/master/imagenes/BB_Entidad.png?raw=true" />
</center>

- Conjuntos de relaciones, con líneas conectando las entidades

  <center>
    <img height="200px" src="https://github.com/ssanchezgoe/flask_vscode_tutorial/blob/master/imagenes/BB_Conjunto_relaciones.png?raw=true" />
</center>


- Anotaciones de patas de gallo

  <center>
    <img height="80px" src="https://github.com/ssanchezgoe/flask_vscode_tutorial/blob/master/imagenes/BB_pataGallo.png?raw=true" />
</center>


Veamos un ejemplo que trabajamos en la sección anterior de entidades y atributos que se resumen en la siguiente tabla: 



Entidad | Atributos
-- | --
Vivienda | - Tipo <br> - Precio <br> - Habitaciones <br> - Barrio <br> - Parqueadero <br> - Estrato <br> - Ciudad <br> - Área
Propietario | - ID propietario <br> - Nombre <br> - Apellido <br> - e-mail <br> - País <br> - Ciudad

**¿Qué relación existe entre las entidades Vivien y Propietario?**

1. Una vivienda tiene que tener al menos un propietario.
2. Un propietario tendrá al menos una casa

De estos ejemplos vemos que una vivienda necesita al menos un propietario. El conjunto de relaciones que se da aquí es de propietario. Una vivienta debe tener al menos un propietario.

- **Relación uno a uno** 

En el siguiente esquema se ilustra dicha relación en donde una vivienda tiene un solo propietario. Las líneas gruesas indican que cada entidad en el conjunto de entidades está relacionada mediante una relación. A esto se le llama relación uno a uno. En los diagramas de relaciones solo se utilizan entidades. Los atributos se omiten porque pueden saturar los diagramas.

<center>
    <img height="200px" src="https://github.com/ssanchezgoe/flask_vscode_tutorial/blob/master/imagenes/one-to-one.png?raw=true" />
</center>

- **Relación uno a varios**

En el siguiente esquema se ilustra dicha relación en donde una vivienda tiene más de un propietario. Este caso se representa usando el esquema de pata de gato para representar una relación de **uno-a-varios** (one-to-many)


<center>
    <img height="200px" src="https://github.com/ssanchezgoe/flask_vscode_tutorial/blob/master/imagenes/one-to-many.png?raw=true" />
</center>

- **Relación varios a varios**

En el siguiente esquema se ilustra dicha relación en donde una varias viviendas con varios propietario. Este caso se representa usando dos esquemas de pata de gato para representar las relacion de **varios-a-varios** (many-to-many)


<center>
    <img height="200px" src="https://github.com/ssanchezgoe/flask_vscode_tutorial/blob/master/imagenes/varios-a-varios.png?raw=true" />
</center>

##**4. Mapeo de entidades a tablas**

En esta sección se expondrá como pasar de un diagrama Entidad-Relación a una tabla de una base de datos relacional compuesta por filas y columnas.

### **Diagramas ER**

Los diagramas de Entidad-Relación representan los cimientos para construir una base de datos. En el diseño de una base de datos relacional, se debe emppesar con un diagrama ER, para luego mapearlo a tablas en una base de datos.

Veamos los dos casos expuestos de las entidades Vivienda y Propietario:

Entidad <br> Tabla | Atributos <br> Columnas
-- | --
Vivienda |- ID_Vivienda <br> - Tipo <br> - Precio <br> - Habitaciones <br> - Barrio <br> - Parqueadero <br> - Estrato <br> - Ciudad <br> - Área
Propietario | - ID propietario <br> - Nombre <br> - Apellido <br> - e-mail <br> - País <br> - Ciudad

Las dos tablas derivadas de estas dos entidades serían las siguientes

- Entidad Vivienda

ID_Vivienda | Tipo | Precio | Habitaciones | Barrio | Parqueadero | Estrato | Ciudad | Área
-- | -- | -- | -- | -- | -- | -- | -- | --
0001A| Apartamento | 280.000.000| 2 | El portal | Si | 4 | Envigado | 80 m$^2$
0002A|Casa | 580.000.000| 4 | Usaquén | Si | 6 | Bogotá | 220 m$^2$
0003A|Aparta Estudio | 200.000.000| 1 | Estadio | No | 5 | Medellín | 50 m$^2$
0004A|Apartamento | 160.000.000| 2 | Aranjuez | No | 3 | Medellín | 85 m$^2$
0005A|Casa | 770.000.000| 3 | Cedritos | Si | 6 | Bogotá | 310 m$^2$

- Entidad Propietario

ID Propietario | Nombre | Apellido | e-mail | País | Ciudad 
-- | -- | -- | -- | -- | -- 
00001 | Carlos| Castro | cc2@gmail.com | Colombia |  Envigado
00002 | Adriana| Tamayo | atamayo22@outlook.com | Colombia | Bogotá
00003 | Pedro| Parra | pp3@mailito.com | Colombia | Calí 
00004 | Isabel| Idarraga | ii3@hotmail.com |Colombia | Cartagena
00005 | Ana| Alcántara | aa1@utp.com | Colombia | Bello

##**5. Conceptos del modelo relacional**

En esta sección se aboradrán los siguientes objetivos

-  Definición de los términos relacionales: relación, grado y cardinalidad.

- Explicación de la diferencia entre **esquema relacional** e **instancia relacional**.

### **Introducción**

El modelo relacional fue propuesto por primera vez en 1970, y se basó en un modelo matemático de donde se heredaron varios términos. 

**Conceptos del modelo relacional:**

Los bloques constitutivos (building blocks) de un modelo relacional son:

- Relaciones: Una relación es un concepto que se basa en la idea de conjuntos.
- Conjunto: Es una collección de elementos distintos sin orden, pero del mismo tipo.

**Base de datos relacional:**

Una **base de datos relacional** es conjunto de relaciones. La **relación** es, a su vez, un término matemático para una tabla, que es una combinación de filas y columnas. Una **relación** se divide en dos partes

- Esquema relacional: Especifica el nompre de dicho esquema y los nombres y tipos de cada atributo. Por ejemplo, en el caso de la relación *Vivienda* tenemos:

Atributo | Tipo
-- | --
Tipo| `string`
Precio| `float`
Habitaciones| `int`
Barrio| `int`
Parqueadero| `string`
Estrato| `int`
Ciudad| `string`
Área |`float`

- Instancia relacional: Tabla compuesta por filas y columnas
  - Columnas $\rightarrow$ Atributos/Campos
  - Filas $\rightarrow$ Tuplas
  - Grado:  Número de atributos
  - Cardinalidad: Número de tuplas


<center>
    <img height="250px" src="https://github.com/ssanchezgoe/flask_vscode_tutorial/blob/master/imagenes/instancia_relacional.png?raw=true
" />
</center>

# **B. Restricciones del modelo relacional y Objetos de Datos**

A lo largo de esta sección se cubrirán los dos siguientes temas:

- Introducción a las restricciones del modelo relacional.
- Restricciones del modelo relacional avanzadas.

## **1. Introducción a las restricciones del modelo relacional**

En esta subsección se estudiarán los siguientes tópicos:

- Explicación de las referencias.
- Diferencias entre clave primaria y clave foranea.
- Identificación de una tabla padre y tabla dependiente.

<p><a name="referencias"></a></p>

###**Referencias**

Dentro de cualquier negocio, los datos deben cumplir con ciertas restricciones o reglas. 


En esta subsección, nos remitiremos al ejempo de **Vivienda** y **Propietario**. En una relación uno a uno se vió que una **Vivienda** le corresponde a solo un **Propietario**. Para buscar la información del **Propietario**, la entidad **Vivienda** se refiere a la entidad **Propietario**. Para buscar la información de **Vivienda**, la entidad **Propietario** se refiere a la entidad **Vivienda**; en un modelo de datos relacionales, a esto se le conoce como referencia. En las bases de datos relacionales, esto establece la integridad de los datos entre dos relaciones.



<center>
    <img height="250px" src="https://github.com/ssanchezgoe/flask_vscode_tutorial/blob/master/imagenes/referenciacion.png?raw=true
" />
</center>

###**Representación de un modelo de datos relacional en un Diagrama ER.**

El diagrama de Entidad-Relación representa el modelo de datos relacionales para la entidad de **Propietario** y la entidad **Vivienda** como parte de un modelo de base de datos de una inmobiliaria simplificada. 

Además, se han agregado otras entidades, como Comprador, Lista_Propietario y Copia. Nótese que los atributos `ID_Propietario`, `ID_vivienda`, `ID_Comprador` e `ID_Copia`  tienen una ubicación especial que la asigna como la **clave principal**. Una **clave principal** de una tabla relacional identifica de forma única cada fila de una tabla. Nótese además que algunos atributos tienen el indicativo **FK**. Por ejemplo, la entidad `Copia` tiene el atributo `ID_vivienda` etiquetado como `FK`. `FK` nos indica una **clave externa**, que corresponde a un conjunto de columnas que hacen referencia a una **clave primaria** de otra tabla. Estas entidades son parte del conjunto de relaciones entre las entidades por arriba de ellas. Todas las entidades tienen una relación de uno a varios establecida entre ellas.


<center>
    <img height="500px" src="https://github.com/ssanchezgoe/flask_vscode_tutorial/blob/master/imagenes/ERC_claves.png?raw=true
" />
</center>

###**Terminología del modelo relacional**

Alguna terminología relacionada con el esquema anterior es la siguiente:

- Tabla padre: Una tabla que contienen una **clave primaria** que se realaciona con al menos una **clave foránea** se le conoce como **tabla padre**. En el caso de la inmobiliaria, las tablas de **Vivienda** y **Propietario** son tablas padres. 
- Tabla dependiente: Una tabla que posee al menos una **clave foránea** se le conoce como **tabla dependiente** o **tabla hijo**. En ERD anterior, las tablas `Lista_propietario` y `Copia` son tablas dependientes.

##**2. Restricciones avanzadas al modelo relacional**

En esta subsección se abarcarán los siguientes tópicos:

- Seis restricciones en el modelo relacional de bases de datos.

- Descripción de diferentes tipos de restricciones del modelo relacional.

###**Restricciones**

Dentro de cualquier negocio, los datos deben seguir ciertas reglas o restricciones. Las **restricciones** facilitan en un negocio la implementación de reglas para preservar correctamente los datos. En un modelo relacional de datos, la integridad de estos puede alcanzarse al usar reglas y restricciones. Las siguientes seis restricciones se definen en un modelo de bases de datos relacional:

- Restricción a la **Integridada de la Entidad**
- Restricción a la **Integridad Referencial**
- Restricción a la **Integridad Semántica**
- Restricción al **Dominio**
- Restricción de **`Null`**
- Restricción de **Revisión**

####**Restricción a la Integridad de la Entidad**

Para identificar cada tupla en una relación, la relación debe contener una **clave primaria** `[FK]`. La **clave primaria** es un valor único que identifica cada tupla o fila en la tabla. A esta restricción la conocemos como **Restricción a la Integridad de la Entidad**; también puede usarse el término **Restricción a la clave primaria**  o **Restricción Única**. El objetivo de esta restricción es evitar valores duplicados en la tabla. Para implementar estas retricciones, se deben usar índices. 

La restricción a la integridad de la entidad establece que ningún atributo que haga parte de la clave primaria de una relación puede tener por valor un `NULL`. El valor `Null` nos indica que no conocemos el valor almacenado. En la restricción a la integridad de la entidad, la **clave primaria** no puede tener un valor desconocido. Por ejemplo, en la siguiente relación, correspondiente a la `Vivienda`, `ID_Vivienda` repreenta la clave primaria e identifica cada tupla de la relación. En este caso, `ID_Vivienda 0001A` apunta a un apartamento en el Portal, Envigado. Sin embargo, Si hacemos nulo a  `ID_Vivienda 0001A`, aún se podrá identificar la vivienda en el Portal, Envigado. Sin embargo, si hacemos `ID_Vivienda 0005A` nula también, no sabremos identificar a qué tupla le correponde qué valor nulo. Con la restricción a la integridad de la entidad, los atributos que hacen parte de la clave primaria pueden aceptar valores de ID nulos. 
 
<font color='red'>ID_Vivienda [FK]</font> | <font color='red'>Tipo</font> | <font color='red'>Precio</font> | <font color='red'>Habitaciones</font> | <font color='red'>Barrio</font> | <font color='red'>Parqueadero</font> | <font color='red'>Estrato</font> | <font color='red'>Ciudad</font> | <font color='red'>Área</font>
-- | -- | -- | -- | -- | -- | -- | -- | --
0001A| Apartamento | 280.000.000| 2 | El portal | Si | 4 | Envigado | 80 m$^2$
0002A|Casa | 580.000.000| 4 | Usaquén | Si | 6 | Bogotá | 220 m$^2$
0003A|Aparta Estudio | 200.000.000| 1 | Estadio | No | 5 | Medellín | 50 m$^2$
0004A|Apartamento | 160.000.000| 2 | Aranjuez | No | 3 | Medellín | 85 m$^2$
0005A|Casa | 770.000.000| 3 | Cedritos | Si | 6 | Bogotá | 310 m$^2$

####**Restricción a la integridad referencial**

La **Restricción a la integridad referencial** define relaciones entre tablas, asegurándose que estas relaciones permanezcan válidas. La validez de un datos es reforzada usando una combinación de claves primarias y claves foráneas. Como se mencionó en la sección de [referencias](#referencias), para que una vivienda pueda existir, se necesita de al menos un propietario.

####**Restricción a la Integridad Semántica**

La **Restricción a la Integridad Semántica**, hace referencia a la exactitud del significado de los datos. Por ejemplo, si en atributo (columna) ciudad de la tabla `Propietario`, se encontrara un valor sin sentido, la restricción a la integridad semántica nos impone revisar su validez.

ID Propietario | Nombre | Apellido | e-mail | País | Ciudad 
-- | -- | -- | -- | -- | -- 
00001 | Carlos| Castro | cc2@gmail.com | Colombia | <font color='red'>**$GfasFD**</font> 
00002 | Adriana| Tamayo | atamayo22@outlook.com | Colombia | Bogotá
00003 | Pedro| Parra | pp3@mailito.com | Colombia | Calí 
00004 | Isabel| Idarraga | ii3@hotmail.com |Colombia | Cartagena
00005 | Ana| Alcántara | aa1@utp.com | Colombia | Bello

####**Restricción al Dominio**

La **Restricción al Dominio** especifica el tipo de dato que debe contener una columna. Por ejemplo, en la relación `Vivienda`, las ciudades son identificadas con nombres; si en algunas entradas tuviésemos un valor numérico, éste carecería de sentido.

ID_Vivienda | Tipo | Precio | Habitaciones | Barrio | Parqueadero | Estrato | Ciudad | Área
-- | -- | -- | -- | -- | -- | -- | -- | --
0001A| Apartamento | 280.000.000| 2 | El portal | Si | 4 | Envigado | 80 m$^2$
0002A|Casa | 580.000.000| 4 | Usaquén | Si | 6 | <font color='red'>**34**</font> | 220 m$^2$
0003A|Aparta Estudio | 200.000.000| 1 | Estadio | No | 5 | Medellín | 50 m$^2$
0004A|Apartamento | 160.000.000| 2 | Aranjuez | No | 3 | Medellín | 85 m$^2$
0005A|Casa | 770.000.000| 3 | Cedritos | Si | 6 | Bogotá | 310 m$^2$

**Nota:** Las restricciones de **Semántica** y **Dominio** son similares, no obstante, la primera nos indica si un valor almacenado tiene signifido o nó, mientras que la segunda nos indica si el tipo del dato almacenado es correcto.

####**Restricción de `Null`**

La restricción de `Null` establece que ningún atributo debe aceptar valores `Null` o vacios. Por ejemplo, si en la entidad `Propietario` alguno de los atributos de `Nombre` o `Apellido` contienen valores nulos, sería difícil identificar al propietario de un inmueble.

ID Propietario | Nombre | Apellido | e-mail | País | Ciudad 
-- | -- | -- | -- | -- | -- 
00001 |  <font color='red'>**Null**</font>| Castro | cc2@gmail.com | Colombia | Envigado 
00002 | Adriana|  <font color='red'>**Null**</font>  | atamayo22@outlook.com | Colombia | Bogotá
00003 | Pedro| Parra | pp3@mailito.com | Colombia | Calí 
00004 | Isabel| Idarraga | ii3@hotmail.com |Colombia | Cartagena
00005 | Ana| Alcántara | aa1@utp.com | Colombia | Bello

En este sentido, un propietario no podría tener valores nulos en su nombre o apellido.

####**Restricción de Revisión**

La **Restricción de Revisión** (Check) refuerza la **integridad de dominio** al limitar los valores que acepta el atributo. En la relación `Vivienda`, el atributo `Estrato` tiene, en Colombia, un valor entero entre 1 y 6; en caso de tener un valor diferente, no tendría sentido. La restricción de revisión impondría a la integridad del dominio una limitación en los valores, **aceptando solo ciertos valores**.


ID_Vivienda | Tipo | Precio | Habitaciones | Barrio | Parqueadero | Estrato | Ciudad | Área
-- | -- | -- | -- | -- | -- | -- | -- | --
0001A| Apartamento | 280.000.000| 2 | El portal | Si | 4 | Envigado | 80 m$^2$
0002A|Casa | 580.000.000| 4 | Usaquén | Si | 6 | Bogotá | 220 m$^2$
0003A|Aparta Estudio | 200.000.000| 1 | Estadio | No | <font color='red'>**8**</font> | Medellín | 50 m$^2$
0004A|Apartamento | 160.000.000| 2 | Aranjuez | No | 3 | Medellín | 85 m$^2$
0005A|Casa | 770.000.000| 3 | Cedritos | Si | 6 | Bogotá | 310 m$^2$

####**Recapitulación** 

**Primary Keys**

Si una esquema relacional arroja más de una clave, entonces, cada una de ellas se convierte en una candidata. Una de ellas, debe ser designada como clave primaria y el resto como secundarias.

En una base de datos relacional, cada esquema de relación debe tener una clave primaria.

**Reglas para las claves primarias:**


Es importante señalar que los valore de las claves primarias deben ser únicos para cada instancia de una entidad/tabla. Debemos tener las siguientes consideraciones respesto a las claves primarias:

- No pueden existir valores nulos. 
- Son inmutables.
- Si una clave primaria consiste de múltiples atributos, ninguno de ellos se puede actualizar.
 

**Integridad semántica**


La integridad semántica nos asegura que los datos entrados en una fila, reglejen un valor permitido. El valor debe estar dentro de un dominio de valores permitidos. 
 

**Restricciones semánticas**

Las restricciones semanticas, también conocidas como reglas basadas en aplicaciones o reglas de negocio, en donde se dan especificaciones adionales por los administradores de la base de datos. Por ejemplo, una tienda no debe tener más de 30 artículos; los salarios de los empleados no deben superar el del administrador.

**Restricciones de dominio**

Nos indica el dominio dentro del cual cada atributo de una base de datos debe estar. Los tipos de datos asociados son:

- Integers (short integer, integer, long integer)
- Real numbers (float y double)
- Characters
- Booleans
- CHAR y VARCHAR
- Date, time, timestamp
- Moneda
- Otros.

#**C. Lenguaje de Definición de Datos (DDL) y Lenguaje de Manipulación de Datos (DML)**

Los tópicos, relacionados sentencias, trabajados durantes esta sección serán:

- Sentencia de creación de una tabla (Create)
- Sentencia de Inserción en una tabla (Insert)
- Sentencia de selección en una tabla (Select)
- Sentencias de actualización y eliminación (Update y Delete)

##**Introducción**

Para la mayoría de la comunidad que hace uso de las bases de datos, existe 5 sentencias primordiales para operar con bases datos:

- **Creación** de una tabla
- **Inserción** de datos en una tabla
- **Selección** de datos de una tabla
- **Actualización** de datos de una tabla
- **Eliminación** de datos de una tabla

En referencia a esto, existen dos Lenguajes relacionados con las bases de datos:

- Lenguaje de Definición de Datos (DDL - Data Language Definition): Se usan para definir, cambiar o eliminar datos. Los DDL tienen como función principal la creación de objetos de bases de datos. 
- Lenguaje de Manipulación de Datos (DML - Data Managment Definition): Se usa para leer y modificar datos.

##**Creación de una tabla**

En esta sección se aprendera a:

- Explicar cómo los nombres de las entidades y los atributos son usados en una tabla de bases de datos relacionales.

Como se ha mencionado en varias ocasiones, en una base de datos relacional, los datos son organizados en tablas, formadas por filas y colomnas. Basándonos en el ejemplo de las entidades `Vivienda` y `Propietario`, creamos una tabla usando el nombre de la entidad. Los atributos de la entidad serán las columnas de las tablas. 

Si usamos como ejemplo al propietario, se empieza por crear la tabla `Propietario` y se asigna los tipos de datos a los atributos de la tabla. En SQL, la creación de una tabla seria de la forma



```
#Creación tabla Propietario
CREATE TABLE Propietario (
    ID_propietario CHAR(5) CONSTRAINT PROPIETARIO_PK PRIMARY KEY (Propietario_id) NOT NULL,
    Nombre VARCHAR(15) NOT NULL,
    Apellido VARCHAR(15) NOT NULL,
    e-mail VARCHAR(15),
    Pais VARCHAR(15),
    Ciudad VARCHAR(15)
   ....
);
```

La sentencia `CREATE TABLE` pertenecen a las instrucciones DDL.  

En la creación se debe tener en cuenta que `ID_Propietario` es la **clave primaria**. Esta restricción evita valores duplicados en la tabla. 

Por otro lado, de la tabla `Propietario`

ID_Propietario | Nombre | Apellido | e-mail | País | Ciudad 
-- | -- | -- | -- | -- | -- 
00001 | Carlos| Castro | cc2@gmail.com | Colombia |  Envigado
00002 | Adriana| Tamayo | atamayo22@outlook.com | Colombia | Bogotá
00003 | Pedro| Parra | pp3@mailito.com | Colombia | Calí 
00004 | Isabel| Idarraga | ii3@hotmail.com |Colombia | Cartagena
00005 | Ana| Alcántara | aa1@utp.com | Colombia | Bello

los tipos de cada atributo, serían:

- `ID_Propietario`: `Char`
- `Nombre`: `VARCHAR`
- `Apellido`: `VARCHAR`
- `e-mail`: `int`
- `País`: `VARCHAR`
- `Ciudad`: `VARCHAR`

Tenga en cuena que los atributos de `Nombre` y `Apellido` deben tener restricción de no `NULL`, para asegurar que no contenga datos nulos: Todo propietario debe tener Nombre y Apellido.

###**CREATE en sqlite3 - python**

En `python`, usamos el `sqlite` para manipulación de bases de datos serverless. 

Con este módulo:

- Se debe primero crear un objeto conexión que represetna la base de datos
- Opcionalmente, se crea un objeto cursor, que ayuda a ejecutar todos las instrucciones `SQL`.

In [10]:
import sqlite3 
import pandas as pd

# Conexión 
conn = sqlite3.connect('ejemplo_empleados.db')

#Creating a cursor object using the cursor() method
cursor = conn.cursor()

#Doping EMPLOYEE table if already exists.
cursor.execute("DROP TABLE IF EXISTS EMPLOYEE")

#Creating table as per requirement
sql ='''CREATE TABLE empleados(
   NOMBRE CHAR(20) NOT NULL,
   APELLIDO CHAR(20),
   EDAD INT,
   SEXO CHAR(1),
   SALARIO FLOAT
)'''

cursor.execute(sql)

cursor.execute("SELECT * FROM empleados")
df = pd.DataFrame(cursor.fetchall(), columns=list(map(lambda x: x[0], cursor.description)))

conn.close()

df

Empty DataFrame
Columns: [NOMBRE, APELLIDO, EDAD, SEXO, SALARIO]
Index: []

Nótese que, hasta el momento, se ha creado una entidad dentro de la base de datos en la cual no se registra ninguna entrada. Comprobemos la exitencia de la base de datos:

In [11]:
ls -la

total 24
drwxr-xr-x 1 root root 4096 Sep  1 22:07 ./
drwxr-xr-x 1 root root 4096 Sep  1 22:03 ../
drwxr-xr-x 1 root root 4096 Aug 31 16:13 .config/
-rw-r--r-- 1 root root 8192 Sep  1 22:07 ejemplo_empleados.db
drwxr-xr-x 1 root root 4096 Aug 27 16:39 sample_data/

##**Sentencia INSERT**

En esta sesión el estudiante desarrollará las siguientes habilidades

- Identificar la sintaxis relacionada con la sentencia INSERT.
- Explicar los dos métodos para insertar filas y columnas en una tabla

###**Adición de filas a una tabla**

Después de que una tabla se crea, necesitaremos rellenar la tabla con datos. Para este fin, usamos la sentencia `INSERT`, con el fin de adicionar nuebas filas. LA sentencia INSERT hace parte del *Lenguaje de Manipulación de Datos* - DML (las sentencias DML se usan para leer y modificar los datos).

Retomando el ejemplo de la entidad `Propietario`, empezamos por crear dicha entidad usando el nombre de la relación (`Propietario`), y los atributos de la tabla como columnas (`ID_Propietario`, `Nombre`, `Apellido`, `email`, `Pais` y `Ciudad`). El siguiente paso es la adición de entradas o filas a la tabla, mediante la sentencia `INSERT` mediante la siguiente sintaxis



```
INSERT INTO table_name (column1, column2, column3, ...)
VALUES (value1, value2, value3, ...)
```

Por ejemplo, para insertar la primera fila de la relación `Propietario`

ID_Propietario | Nombre | Apellido | e-mail | País | Ciudad 
-- | -- | -- | -- | -- | -- 
00001 | Carlos| Castro | cc2@gmail.com | Colombia |  Envigado
00002 | Adriana| Tamayo | atamayo22@outlook.com | Colombia | Bogotá
00003 | Pedro| Parra | pp3@mailito.com | Colombia | Calí 
00004 | Isabel| Idarraga | ii3@hotmail.com |Colombia | Cartagena
00005 | Ana| Alcántara | aa1@utp.com | Colombia | Bello

Escribiríamos lo  en SQL:


```
INSERT INTO Propietario (ID_Propietario, Nombre, Apellido, e-mail, Pais, Ciudad)
VALUES ('0001', 'Carlos', 'Castro', 'cc2@gmail.com', 'Colombia', 'Envigado')
```

Para rellenar una tabla, no es necesario hacerlo una fila por vez, en su lugar podemos escribir

```
INSERT INTO Propietario 
(ID_Propietario, Nombre, Apellido, e-mail, Pais, Ciudad)
VALUES 
('0001', 'Carlos', 'Castro', 'cc2@gmail.com', 'Colombia',  ' Envigado')
('00002', 'Adriana', 'Tamayo', 'atamayo22@outlook.com', 'Colombia', 'Bogota')

```

###**INSERT EN sqlite3**

In [12]:
#Conexión a la base de datos
conn = sqlite3.connect('ejemplo_empleados.db')

#Creación del objeto cursor mediante el método cursor()
cursor = conn.cursor()

# Preparación de solicitud SQL para insertar una instancia en la base de datos.

records = [('Sebastian', 'Sanchez', 35, 'M', 2000000), 
           ('Daniela', 'Perez', 22, 'F', 5000000),
           ('Martha', 'Roldan', 44, 'F', 8000000),
           ('Camilo', 'Cañas', 32, 'M', 9000000),
           ('Andres', 'Vargas', 46, 'M', 1000000)]

cursor.executemany('INSERT INTO empleados VALUES(?,?,?,?,?)', records)

# Uno a uno
#cursor.execute('''INSERT INTO empleados(
#   NOMBRE, APELLIDO, EDAD, SEXO, SALARIO) VALUES 
#   ('Sebastian', 'Sanchez', 35, 'M', 2000000)''')

#cursor.execute('''INSERT INTO empleados(
#   NOMBRE, APELLIDO, EDAD, SEXO, SALARIO) VALUES 
#   ('Daniela', 'Perez', 22, 'F', 5000000)''')

#cursor.execute('''INSERT INTO empleados(
#   NOMBRE, APELLIDO, EDAD, SEXO, SALARIO) VALUES 
#   ('Martha', 'Roldan', 44, 'F', 8000000)''')

#cursor.execute('''INSERT INTO empleados(
#   NOMBRE, APELLIDO, EDAD, SEXO, SALARIO) VALUES 
#   ('Camilo', 'Cañas', 32, 'M', 9000000)''')

#cursor.execute('''INSERT INTO empleados(
#   NOMBRE, APELLIDO, EDAD, SEXO, SALARIO) VALUES 
#   ('Andres', 'Vargas', 46, 'M', 1000000)''')

# DataFrame
cursor.execute("SELECT * FROM empleados")
df = pd.DataFrame(cursor.fetchall(), columns=list(map(lambda x: x[0], cursor.description)))

# commit
conn.commit()
print("Instancias registradas")

# Cierre de conexión
conn.close()

df

Instancias registradas

      NOMBRE APELLIDO  EDAD SEXO    SALARIO
0  Sebastian  Sanchez    35    M  2000000.0
1    Daniela    Perez    22    F  5000000.0
2     Martha   Roldan    44    F  8000000.0
3     Camilo    Cañas    32    M  9000000.0
4     Andres   Vargas    46    M  1000000.0

##**Sentencia `SELECT`**

Al finalizar esta sección, se adquirirán las siguientes competencias:

- Recuperación de datos de una tabla de una base de datos relacional.
- Definición del uso de un predicado.
- Identificación de la sintaxis de la sentencia `SELECT`, usando la clausula `WHERE`.
- Lista de los operadores de comparación soportados por un Sistema de manejo de una base de datos relacional (RDBMS).

###**Introducción**

El proposito principal de un sistema de manipulación de datos, no solo consite en guardar datos, sino también facilitar la recuperación de los mismo. 

Después de crear una tabla e insertar datos en ella, lo siguiente sería recuperar los datos. Para este fin usamos la sentencia `SELECT`, que hace parte del Lenguaje de manipulación de Datos (DML), usaado para la lectura y modificación de los mismos.

La sentencia `SELECT` se conoce como consulta (query), y la salida que se obtiene de un query se llama Resultado (Result) o Resultado de la tabla (Result Table)

###**Recuperación de filas de una tabla**

En su forma más sencilla, usamos la sentencia `SELECT` de la siguiente forma:

```
SELECT * FROM table_name;
```

Si nos remitimos al ejemplo de propietarios de inmuebles, las filas de la entidad `Propietario`

ID_Propietario | Nombre | Apellido | e-mail | País | Ciudad 
-- | -- | -- | -- | -- | -- 
00001 | Carlos| Castro | cc2@gmail.com | Colombia |  Envigado
00002 | Adriana| Tamayo | atamayo22@outlook.com | Colombia | Bogotá
00003 | Pedro| Parra | pp3@mailito.com | Colombia | Calí 
00004 | Isabel| Idarraga | ii3@hotmail.com |Colombia | Cartagena
00005 | Ana| Alcántara | aa1@utp.com | Colombia | Bello


Pueden recuperarse todas mediante la siguiente instrucción

```
SELECT * FROM Propietario;
```

Adicionalmente, se puede recuperar todas las filas de unas cuantas columnas al especificar los nombres de las columnas de forma individual y separadas por comas:


```
SELECT Nombre, Apellido, Ciudad from Propietario;
```

###**SELECT en sqlite3**

In [13]:
import sqlite3

#Conexión a la base de datos
conn = sqlite3.connect('ejemplo_empleados.db')

#Creación de un objeto cursor
cursor = conn.cursor()

#Recuperación de datos
cursor.execute('''SELECT * from empleados''')

#Obtención primera fila
result = cursor.fetchone();
print("Primera Fila: ", result)

#Obtención de las instancias
result = cursor.fetchall();
print("Todas las filas:\n", pd.DataFrame(result, columns=list(map(lambda x: x[0], cursor.description))))

#Efectuar cambios
conn.commit()

#Cerrar conexión
conn.close()

Primera Fila:  ('Sebastian', 'Sanchez', 35, 'M', 2000000.0)
Todas las filas:
     NOMBRE APELLIDO  EDAD SEXO    SALARIO
0  Daniela    Perez    22    F  5000000.0
1   Martha   Roldan    44    F  8000000.0
2   Camilo    Cañas    32    M  9000000.0
3   Andres   Vargas    46    M  1000000.0

<p><a name="WHERE"></a></p>

##**Restricción del resultado de un conjunto: Clausula `WHERE`**

Las operaciones relacionales nos ayudan a restringir los resultados de un conjunto mediante el uso de la clausula `WHERE`. Esta clausula siempre requiere un predicado, que corresponde a una condición cuyo valor es un booleano `True`, `False` o incierto. Los predicados son usados en la condición de la busqueda de la clausula `WHERE`. 


Consideremos, por ejemplo, la entidad `Vivienda` como la tabla

ID_Vivienda | Tipo | Precio | Habitaciones | Barrio | Parqueadero | Estrato | Ciudad | Área
-- | -- | -- | -- | -- | -- | -- | -- | --
0001A| Apartamento | 280.000.000| 2 | El portal | Si | 4 | Envigado | 80 m$^2$
0002A|Casa | 580.000.000| 4 | Usaquén | Si | 6 | Bogotá | 220 m$^2$
0003A|Aparta Estudio | 200.000.000| 1 | Estadio | No | 4 | Medellín | 50 m$^2$
0004A|Apartamento | 160.000.000| 2 | Aranjuez | No | 3 | Medellín | 85 m$^2$
0005A|Casa | 770.000.000| 3 | Cedritos | Si | 6 | Bogotá | 310 m$^2$

Si queremos saber el tipo de vivienda con un `ID_Vivienda` igual a `0002A`, usamos la clausula `WHERE`, con el predicado `ID_Vivienda` igual a `0002A`

```
SELECT ID_Vivienda, Tipo FROM Vivienda
WHERE ID_Vivienda='0002A'; 
```

###**Operadores de Comparación:**

En el ejemplo anterior se usó el operador "igual a" en la clausula `WHERE`. Los operadores que admite esta clasula se resumentn en la siguiente tabla

Nombre | Operador
---|---
Igual a | `=`
Mayor a | `>`
Menor a | `<`
Mayor o igual a | `>=`
Menor o igual a | `<=`
No igual a | `<>`

###**CLAÚSULA `WHERE` en `sqlite3`**

In [14]:
#Conexión a la base de datos
conn = sqlite3.connect('ejemplo_empleados.db')

#Creación de un objeto cursor
cursor = conn.cursor()

#Recuperación de datos
cursor.execute("SELECT * from empleados WHERE EDAD<=35")

#Obtención de las instancias
result = cursor.fetchall();

# Inprimir resultado
#print("Todas las filas:\n ", result)))
df = pd.DataFrame(result, columns=list(map(lambda x: x[0], cursor.description)))

#Efectuar cambios
conn.commit()

#Cerrar conexión
conn.close()

df

      NOMBRE APELLIDO  EDAD SEXO    SALARIO
0  Sebastian  Sanchez    35    M  2000000.0
1    Daniela    Perez    22    F  5000000.0
2     Camilo    Cañas    32    M  9000000.0

<p><a name="update_delete"></a></p>

##**Sentencias `UPDATE` y `DELETE`**

En esta sección se aprenderá de los siguientes tópicos:

- Identificación de la sintaxis de la sentencia `UPDATE`
- Identificación de la sintaxis de la sentencia `DELETE`
- Explicación de la importancia de la clausula `WHERE` en las sentencias `UPDATE` y `DELETE`.

###**Sentencia `UPDATE`**

Despues de crearse y rellenarse con datos una tabla, esta puede ser alterada mediante la sentencia `UPDATE`, que hace parte del Lenguaje de manejo de datos (DML), encargado de leer y modificar los datos. 

```
UPDATE table_name
SET column1 = value1, column2 = value2, ...
WHERE condition;
```

Partamos del ejemplo de la identidad `Propietario`, correspondiente a la siguiente tabla:

ID_Propietario | Nombre | Apellido | e-mail | País | Ciudad 
-- | -- | -- | -- | -- | -- 
00001 | Carlos| Castro | cc2@gmail.com | Colombia |  Envigado
00002 | Adriana| Tamayo | atamayo22@outlook.com | Colombia | Bogotá
00003 | Pedro| Parra | pp3@mailito.com | Colombia | Calí 
00004 | Isabel| Idarraga | ii3@hotmail.com |Colombia | Cartagena
00005 | Ana| Alcántara | aa1@utp.com | Colombia | Bello

Supongamos que queremos cambiar el nombre y apellido de la propietario con ID 00003 por Belina Bedoya; debemos hacer entonces 

```
UPDATE Propietario
SET Nombre = 'Belinda', Apellido= 'Bedoya'
WHERE CustomerID = 0003;
```

####**`UPDATE` en `sqlite3`**

In [15]:
import sqlite3 

#Conexión a la base de datos
conn =  sqlite3.connect('ejemplo_empleados.db')

#Creamos un cursor para realizar operaniones
cursor =  conn.cursor()

#Recuperar todas las filas antes del UPDATE
print("Contenido de la tabla empleados")
cursor.execute("SELECT * from empleados")
#print(cursor.fetchall())
print(pd.DataFrame(cursor.fetchall(), columns=list(map(lambda x: x[0], cursor.description))))

#Actualizar registros
cursor.execute("UPDATE empleados SET EDAD = EDAD+1 WHERE SEXO ='M'")
print("Tabla actualizada")

#Recuperer datos despues de la actualización
print('Contenido de la tabla empleados después de actualizar la tabla:')
cursor.execute("SELECT * from empleados")
#print(cursor.fetchall())
print(pd.DataFrame(cursor.fetchall(), columns=list(map(lambda x: x[0], cursor.description))))

#Commit de los cambios a la base de datos
conn.commit()

#Cerrar conexión
conn.close()

Contenido de la tabla empleados
      NOMBRE APELLIDO  EDAD SEXO    SALARIO
0  Sebastian  Sanchez    35    M  2000000.0
1    Daniela    Perez    22    F  5000000.0
2     Martha   Roldan    44    F  8000000.0
3     Camilo    Cañas    32    M  9000000.0
4     Andres   Vargas    46    M  1000000.0
Tabla actualizada
Contenido de la tabla empleados después de actualizar la tabla:
      NOMBRE APELLIDO  EDAD SEXO    SALARIO
0  Sebastian  Sanchez    36    M  2000000.0
1    Daniela    Perez    22    F  5000000.0
2     Martha   Roldan    44    F  8000000.0
3     Camilo    Cañas    33    M  9000000.0
4     Andres   Vargas    47    M  1000000.0

###**Sentencia DELETE**

Si un momento queremos eliminar una entrada de la tabla, debemos usar la sentencia `DELETE` de la forma siguiente:

```
DELETE FROM table_name WHERE condition;
```

Retomemos el ejemplo de la entidad `Propietario`. Supongamos que por algún motivo, los propietario con `ID_Propietario=0004` e `ID_Propietario=0005` ya vendieron sus inmuebles, por lo que debemos quitarlos de la base de datos. Para esto, realizamos lo siguiente

```
DELETE FROM Propietario
WHERE Propietario IN('0004','0005')
```

####**`DELETE` en `sqlite3`:**

In [16]:
import sqlite3

#Conexión a la base de datos
conn = sqlite3.connect('ejemplo_empleados.db')

#Creación de un cursor para la realización de operaciones SQL
cursor = conn.cursor()

#Inserción de algunos datos más
cursor.execute('''INSERT INTO empleados(
   NOMBRE, APELLIDO, EDAD, SEXO, SALARIO) VALUES 
   ('Barrabas', 'Lopez', 85, 'M', 2000000)''')

cursor.execute('''INSERT INTO empleados(
   NOMBRE, APELLIDO, EDAD, SEXO, SALARIO) VALUES 
   ('Jonas', 'Simons', 22, 'F', 5000000)''')

cursor.execute('''INSERT INTO empleados(
   NOMBRE, APELLIDO, EDAD, SEXO, SALARIO) VALUES 
   ('Isaias', 'Carrero', 44, 'F', 8000000)''')

cursor.execute("SELECT * FROM empleados")
df = pd.DataFrame(cursor.fetchall(), columns=list(map(lambda x: x[0], cursor.description)))

conn.commit()
conn.close()

df

      NOMBRE APELLIDO  EDAD SEXO    SALARIO
0  Sebastian  Sanchez    36    M  2000000.0
1    Daniela    Perez    22    F  5000000.0
2     Martha   Roldan    44    F  8000000.0
3     Camilo    Cañas    33    M  9000000.0
4     Andres   Vargas    47    M  1000000.0
5   Barrabas    Lopez    85    M  2000000.0
6      Jonas   Simons    22    F  5000000.0
7     Isaias  Carrero    44    F  8000000.0

In [17]:
import sqlite3

#conexión

conn = sqlite3.connect('ejemplo_empleados.db')

#cursor
cursor = conn.cursor()

#Borrar datos 
cursor.execute("DELETE FROM empleados WHERE NOMBRE IN ('Barrabas','Jonas','Isaias')")

#Dataframe
cursor.execute("SELECT * FROM empleados")
df = pd.DataFrame(cursor.fetchall(), columns=list(map(lambda x: x[0], cursor.description)))

#Commit
conn.commit()

#Cerrar conexión
conn.close()

df

      NOMBRE APELLIDO  EDAD SEXO    SALARIO
0  Sebastian  Sanchez    36    M  2000000.0
1    Daniela    Perez    22    F  5000000.0
2     Martha   Roldan    44    F  8000000.0
3     Camilo    Cañas    33    M  9000000.0
4     Andres   Vargas    47    M  1000000.0

##**Taller de creación y manipulación de bases de datos:**

En los equipos conformados en clase, cree una base de datos de una sola entidad o tabla usando `sqlite3`. En el ejercicio se deben tener en cuenta los siguientes pasos

1. Creación de la base de datos.
2. Inserción de instancias en dicha base de datos.
3. Selección de algunos datos para visualizar.
4. Selección de de datos mediante la clausula `WHERE`.
5. Actualización de datos.
6. Inserción de nuevos elementos y establecimiento de un criterio para luego borrarlos. 

**Nota:** En cada uno de los pasos deberá visualizar los resultados obtenidos.

#**D. DDL y DML Avanzado**

Los objetivos a desarrollar en esta temática son:

- Patrones con cadenas, rangos y cojuntos.
- Clasificación de conjuntos de resultados
- Agrupar conjuntos de resutados.

##**Patrones en cadenas de caracteres, Rangos y conjuntos**

En esta sección se cubrirá los siguientes temas para la consulta en una base de datos:

- Patrones en cadenas.
- Rangos.
- Conjunto de valores

###**Recuperación de filas de una tabla**

Además del almacenamiento de datos, el proposito fundamental de un sistema de gestión de bases de datos es la recuperación o consulta de dichos datos. 

Como se ha visto, la forma más sencilla de obtener datos de una base SQL es:

```
SELECT * FROM db
```

---
**Repaso:**

Por ejemplo, para la base de datos de la entidad `casas`

ID_Vivienda | Tipo | Precio | Habitaciones | Barrio | Parqueadero | Estrato | Ciudad | Área
-- | -- | -- | -- | -- | -- | -- | -- | --
0001A| Apartamento | 280.000.000| 2 | El portal | Si | 4 | Envigado | 80 m$^2$
0002A|Casa | 580.000.000| 4 | Usaquén | Si | 6 | Bogota | 220 m$^2$
0003A|Aparta Estudio | 200.000.000| 1 | Estadio | No | 5 | Medellín | 50 m$^2$
0004A|Apartamento | 160.000.000| 2 | Aranjuez | No | 3 | Medellín | 85 m$^2$
0005A|Casa | 770.000.000| 3 | Cedritos | Si | 6 | Bogotá | 310 m$^2$

si hacemos

```
SELECT * FROM casas 
```

Obtendremos las 5 filas que componen la tabla.

Podemos obtener un subconjunto de columnas de las casas si hacemos

```
SELECT ID_Vivienda, Tipo from casas
```

en cuyo caso obtemos las columnas almacenadas en `ID_Vivienda` y `Tipo`

Si queremos restringir nuestra busqueda a una sola instancia de la tabla, por ejemplo la vivienda en la que `ID_Vivienda=0003A`, usamos la clausula `WHERE`

```
SELECT ID_Vivienda, Tipo FROM casas WHERE ID_Vivienda='0003A'
```

---


**Problema:**

Centrándonos en la última de las instrucciones del repaso, esto requeriría de un super-humano con muy buena memoria para acordarse exactamente de la instancia de la tabla que desea consultar. No obstante, en muchos casos, no sabremos exactamente que poner en el predicado de la clausula `WHERE`. Uno de estos casos, corresponde, por ejemplo, a un propietario que recordamos que su numbre empieza por una letra. Para abordar este tipo de problemas, podemos usar patrones en cadenas de caracteres.

###**Recuperación de filas usando patrones de cadenas de caracteres**

Si de la tabla de propietarios

ID_Propietario | Nombre | Apellido | e-mail | País | Ciudad 
-- | -- | -- | -- | -- | -- 
00001 | Carlos| Castro | cc2@gmail.com | Colombia |  Envigado
00002 | Adriana| Tamayo | atamayo22@outlook.com | Colombia | Bogotá
00003 | Pedro| Parra | pp3@mailito.com | Colombia | Calí 
00004 | Isabel| Idarraga | ii3@hotmail.com |Colombia | Cartagena
00005 | Ana| Alcántara | aa1@utp.com | Colombia | Bello

deseamos extraer el nombre de la propietaria Isabel Idarraga, pero solo nos acordamos de la letra inicial del nombre, podemos hacer lo siguiente:

```
SELECT Nombre FROM propietarios WHERE Nombre like 'I%'
```

en donde `like` corresponde a un predicado que se usa junto a la clausula `WHERE` para buscar un patrón en una columna. El signo `%` se usa como `wildcard` (comodín) para referirse al resto de caracteres. Este comodín puede usarse antes del antes del patrón, después del patrón o antes y despues del patron. En el caso ilustrado se usa después, para hacer un `match` de los caracteres siguientes al patrón. 

La sentencia anterior recuperará todos los nombres que empiezan por la letra `I`.

In [37]:
import sqlite3

#conexión

conn = sqlite3.connect('ejemplo_empleados.db')

#cursor
cursor = conn.cursor()

#Selección de datos
cursor.execute("SELECT NOMBRE, APELLIDO FROM empleados WHERE NOMBRE LIKE 'M%'")
print("Resultado selección:", cursor.fetchall())

#Commit
conn.commit()

#Cerrar conexión
conn.close()

Resultado selección: [('Martha', 'Roldan')]

###**Recuperación de valores en un Rango**

Imaginemos, por ejemplo, que queremos obtener todas las casas con precios entre  cien millones y trecientos millos de la entidad viviendas:

ID_Vivienda | Tipo | Precio | Habitaciones | Barrio | Parqueadero | Estrato | Ciudad | Área
-- | -- | -- | -- | -- | -- | -- | -- | --
0001A| Apartamento | 280.000.000| 2 | El portal | Si | 4 | Envigado | 80 m$^2$
0002A|Casa | 580.000.000| 4 | Usaquén | Si | 6 | Bogota | 220 m$^2$
0003A|Aparta Estudio | 200.000.000| 1 | Estadio | No | 5 | Medellín | 50 m$^2$
0004A|Apartamento | 160.000.000| 2 | Aranjuez | No | 3 | Medellín | 85 m$^2$
0005A|Casa | 770.000.000| 3 | Cedritos | Si | 6 | Bogotá | 310 m$^2$

En este caso lo podemos hacer de la siguiente forma:

```
SELECT * FROM casas WHERE Precio >=100000000 AND <0 300000000
```

Esta operación es lo mismo que en teoría de conjuntos se hace para definir un rango cerrado `[a,b]`. En este caso obtendremos tres entradas, de las casas `0001A`, `0003A` y `0005B`.

Otra forma de realizar esta búsqueda es mediante el operador `BETWEEN` de la siguiente forma

```
SELECT * FROM casas WHERE Precio BETWEEN 100000000 AND 300000000
```

In [38]:
import sqlite3

#conexión

conn = sqlite3.connect('ejemplo_empleados.db')

#cursor
cursor = conn.cursor()

#Selección de datos
cursor.execute("SELECT NOMBRE, APELLIDO FROM empleados WHERE SALARIO BETWEEN 1000000 AND 4000000")
print("Resultado selección:", cursor.fetchall())

#Commit
conn.commit()

#Cerrar conexión
conn.close()

Resultado selección: [('Sebastian', 'Sanchez'), ('Andres', 'Vargas')]

###**Recuperación de datos usando un conjunto de valores**

Si en la base de datos de las inmobiliarias

ID_Vivienda | Tipo | Precio | Habitaciones | Barrio | Parqueadero | Estrato | Ciudad | Área
-- | -- | -- | -- | -- | -- | -- | -- | --
0001A| Apartamento | 280.000.000| 2 | El portal | Si | 4 | Envigado | 80 m$^2$
0002A|Casa | 580.000.000| 4 | Usaquén | Si | 6 | Bogota | 220 m$^2$
0003A|Aparta Estudio | 200.000.000| 1 | Estadio | No | 5 | Medellín | 50 m$^2$
0004A|Apartamento | 160.000.000| 2 | Aranjuez | No | 3 | Medellín | 85 m$^2$
0005A|Casa | 770.000.000| 3 | Cedritos | Si | 6 | Bogotá | 310 m$^2$

 queremos obtener todas las casas localizadas en `Medellín` o `Bogotá`, podemos hacer lo siguiente:

```
SELECT * FROM casas WHERE Ciudad='Medellín' or Ciudad='Bogota'
```

en cuyo caso obtendremos las instancias con `ID_Vivienda=0002A`, `ID_Vivienda=0003A`, `ID_Vivienda=0004A` y `ID_Vivienda=0005A`.

En caso que queramos obtener viviendas de muchas ciudades (si nuestra base de datos fuese más grande), sería mejor usar el operador `IN`. El caso anterior se podría escribir de la siguiente forma

```
SELECT * FROM casas WHERE Ciudad IN ('Medellín', 'Bogota')

In [39]:
import sqlite3

#conexión

conn = sqlite3.connect('ejemplo_empleados.db')

#cursor
cursor = conn.cursor()

#Selección datos
cursor.execute("SELECT * FROM empleados WHERE EDAD IN (36, 44, 33)")

#Dataframe
print("Resultados:\n", cursor.fetchall())

#Commit
conn.commit()

#Cerrar conexión
conn.close()

Resultados:
 [('Sebastian', 'Sanchez', 36, 'M', 2000000.0), ('Martha', 'Roldan', 44, 'F', 8000000.0), ('Camilo', 'Cañas', 33, 'M', 9000000.0)]

##**Organización de conjuntos de resultados:**

Los objetivos abarcados en esta sección serán:

- Organizar los conjuntos de resultados de forma ascendente o descendente.
- Indicar que columnas usar para el orden.

###**Clausula `ORDER BY`**

Supongamos que queremo obtener todos los nombre de los propietarios del la tabla 

ID_Propietario | Nombre | Apellido | e-mail | País | Ciudad 
-- | -- | -- | -- | -- | -- 
00001 | Carlos| Castro | cc2@gmail.com | Colombia |  Envigado
00002 | Adriana| Tamayo | atamayo22@outlook.com | Colombia | Bogotá
00003 | Pedro| Parra | pp3@mailito.com | Colombia | Calí 
00004 | Isabel| Idarraga | ii3@hotmail.com |Colombia | Cartagena
00005 | Ana| Alcántara | aa1@utp.com | Colombia | Bello

Si escribimos

```
SELECT Nombre FROM propietarios 
```

obtendremos un resultados con los nombres como aparecen en la tabla. Si queremos ordenarlos alfabéticamente, hacemos

```
SELECT Nombre FROM propietarios ORDER BY Nombre
```

Nótese que la clausula `ORDER BY` recibe un predicado para organizar según una de las columnas, en este caso la columna `Nombre`. Debemos tener en cuenta que, por defectom el resultado se muestra en forma ascendente. Para cambiar el orden a descendente hacemos lo siguiente

```
SELECT Nombre FROM propietarios ORDER BY Nombre DESC
```

En lugar de usar el nombre de la columna (`Nombre`), podemos indicar el número de dicha columna de la siguiente forma

```
SELECT Nombre FROM propietarios ORDER BY 2
```

In [30]:
import sqlite3

#conexión

conn = sqlite3.connect('ejemplo_empleados.db')

#cursor
cursor = conn.cursor()

#Selección datos
cursor.execute("SELECT * FROM empleados ORDER BY 2")

#Dataframe
df = pd.DataFrame(cursor.fetchall(), columns=list(map(lambda x: x[0], cursor.description)))

#Commit
conn.commit()

#Cerrar conexión
conn.close()

df

      NOMBRE APELLIDO  EDAD SEXO    SALARIO
0     Camilo    Cañas    33    M  9000000.0
1    Daniela    Perez    22    F  5000000.0
2     Martha   Roldan    44    F  8000000.0
3  Sebastian  Sanchez    36    M  2000000.0
4     Andres   Vargas    47    M  1000000.0

##**Agrupamiento de conjuntos de resultados**

En esta sección se abordarán los siguientes objetivos:

- Eliminación de duplicados de un conjunto de resultados.
- Restricciones en un conjunto de resultados.

###**Eliminación de valores duplicados - Clausula `DISTINT`**

En ciertas ocasiones, la instrucción `SELECT` puede contener valores duplicados. 

Imaginemos que tenemos la siguiente tabla de propietarios:

ID_Propietario | Nombre | Apellido | e-mail | País | Ciudad 
-- | -- | -- | -- | -- | -- 
00001 | Carlos| Castro | cc2@gmail.com | Colombia |  Envigado
00002 | Adriana| Tamayo | atamayo22@outlook.com | Colombia | Bogotá
00003 | Pedro| Parra | pp3@mailito.com | Colombia | Calí 
00004 | Isabel| Idarraga | ii3@hotmail.com |Colombia | Cartagena
00005 | Ana| Alcántara | aa1@utp.com | Colombia | Bello
00006 | Vanesa| Velez | vv1@utp.com | Venezuela | Caracas
00007 | Manuel| Mora | mm1@utp.com | Brazil | Rio de Janeiro

En este caso, si queremos obtener los paises de los propietarios de esta tabla, podemos hacer lo siguiente

```
SELECT Pais FROM propietarios ORDER BY 1
```

Cuya salida será contendrá 7 resutados, uno por propietario, con el país `Colombia` repetido. Para eliminar los resultados repetidos hacemos lo situiente

```
SELECT DISTINCT(Pais) FROM propietarios ORDER BY 1
```

en donde obtendríamos como resultado tres paises: Colombia, Venezuela y Brazil.


Creemos una nueva base de datos, con una tabla, para ejemplificar el problema descrito.

In [31]:
import sqlite3 
import pandas as pd

# Conexión 
conn = sqlite3.connect('ejemplo_empleados_pais.db')

#Creating a cursor object using the cursor() method
cursor = conn.cursor()

#Doping EMPLOYEE table if already exists.
cursor.execute("DROP TABLE IF EXISTS EMPLOYEE")

#Creating table as per requirement
sql ='''CREATE TABLE empleados(
   NOMBRE CHAR(20) NOT NULL,
   APELLIDO CHAR(20),
   EDAD INT,
   SEXO CHAR(1),
   SALARIO FLOAT,
   PAIS CHAR(20)
)'''

cursor.execute(sql)

cursor.execute("SELECT * FROM empleados")
df = pd.DataFrame(cursor.fetchall(), columns=list(map(lambda x: x[0], cursor.description)))

conn.close()

df

Empty DataFrame
Columns: [NOMBRE, APELLIDO, EDAD, SEXO, SALARIO, PAIS]
Index: []

In [33]:
#Conexión a la base de datos
conn = sqlite3.connect('ejemplo_empleados_pais.db')

#Creación del objeto cursor mediante el método cursor()
cursor = conn.cursor()

# Preparación de solicitud SQL para insertar una instancia en la base de datos.

records = [('Sebastian', 'Sanchez', 35, 'M', 2000000, 'COL'), 
           ('Daniela', 'Perez', 22, 'F', 5000000,'COL'),
           ('Martha', 'Roldan', 44, 'F', 8000000,'BRA'),
           ('Camilo', 'Cañas', 32, 'M', 9000000,'ECU'),
           ('Juana', 'Marquez', 33, 'F', 8000000,'COL'),
           ('Estefania', 'Lleras', 36, 'F', 9000000,'COL'),
           ('Diana', 'Camargo', 40, 'F', 6000000,'COL'),
           ('Carlos', 'Jaramillo', 38, 'M', 4000000,'COL'),
           ('Lorena', 'Hincapie', 35, 'F', 4000000,'COL')]

cursor.executemany('INSERT INTO empleados VALUES(?,?,?,?,?,?)', records)

# DataFrame
cursor.execute("SELECT * FROM empleados")
df = pd.DataFrame(cursor.fetchall(), columns=list(map(lambda x: x[0], cursor.description)))

# commit
conn.commit()
print("Instancias registradas")

# Cierre de conexión
conn.close()

df

Instancias registradas

      NOMBRE   APELLIDO  EDAD SEXO    SALARIO PAIS
0  Sebastian    Sanchez    35    M  2000000.0  COL
1    Daniela      Perez    22    F  5000000.0  COL
2     Martha     Roldan    44    F  8000000.0  BRA
3     Camilo      Cañas    32    M  9000000.0  ECU
4      Juana    Marquez    33    F  8000000.0  COL
5  Estefania     Lleras    36    F  9000000.0  COL
6      Diana    Camargo    40    F  6000000.0  COL
7     Carlos  Jaramillo    38    M  4000000.0  COL
8     Lorena   Hincapie    35    F  4000000.0  COL

In [40]:
import sqlite3

#conexión

conn = sqlite3.connect('ejemplo_empleados_pais.db')

#cursor
cursor = conn.cursor()

#Selección datos
cursor.execute("SELECT * FROM empleados ORDER BY 6")

#Dataframe
df = pd.DataFrame(cursor.fetchall(), columns=list(map(lambda x: x[0], cursor.description)))

#Commit
conn.commit()

#Cerrar conexión
conn.close()

df

      NOMBRE   APELLIDO  EDAD SEXO    SALARIO PAIS
0     Martha     Roldan    44    F  8000000.0  BRA
1  Sebastian    Sanchez    35    M  2000000.0  COL
2    Daniela      Perez    22    F  5000000.0  COL
3      Juana    Marquez    33    F  8000000.0  COL
4  Estefania     Lleras    36    F  9000000.0  COL
5      Diana    Camargo    40    F  6000000.0  COL
6     Carlos  Jaramillo    38    M  4000000.0  COL
7     Lorena   Hincapie    35    F  4000000.0  COL
8     Camilo      Cañas    32    M  9000000.0  ECU

In [41]:
import sqlite3

#conexión

conn = sqlite3.connect('ejemplo_empleados_pais.db')

#cursor
cursor = conn.cursor()

#Selección datos
cursor.execute("SELECT distinct(PAIS) FROM empleados")

#Dataframe
df = pd.DataFrame(cursor.fetchall(), columns=list(map(lambda x: x[0], cursor.description)))

#Commit
conn.commit()

#Cerrar conexión
conn.close()

df

  PAIS
0  COL
1  BRA
2  ECU

###**Clausula `GROUP BY`**

Si queremos saber cuantos propietarios hay por país en la tabla de propietarios

ID_Propietario | Nombre | Apellido | e-mail | País | Ciudad 
-- | -- | -- | -- | -- | -- 
00001 | Carlos| Castro | cc2@gmail.com | Colombia |  Envigado
00002 | Adriana| Tamayo | atamayo22@outlook.com | Colombia | Bogotá
00003 | Pedro| Parra | pp3@mailito.com | Colombia | Calí 
00004 | Isabel| Idarraga | ii3@hotmail.com |Colombia | Cartagena
00005 | Ana| Alcántara | aa1@utp.com | Colombia | Bello
00006 | Vanesa| Velez | vv1@utp.com | Venezuela | Caracas
00007 | Manuel| Mora | mm1@utp.com | Brazil | Rio de Janeiro

Podemos usar la cláusula `GROUP BY` de la siguiente forma

```
SELECT Pais, count(Pais) FROM propietarios GROUP BY Pais
```

El resultado de esta ejecución será

```
Pais              2
--------- ---------
Brazil            1
Colombia          5
Venezuela         1
```

La clausula `GROUP BY` agrupa los resultados en subconjuntos de acuerdo a la concordancia que tenga con valores de una o más columnas.

Si se pretende asignar un resultado a la columna `2` del output, se puede hacer de la siguiente forma

```
SELECT Pais, count(Pais) as count FROM propietarios GROUP BY Pais
```

para obtener a la salida

```
Pais          COUNT
--------- ---------
Brazil            1
Colombia          5
Venezuela         1
```

In [42]:
import sqlite3

#conexión

conn = sqlite3.connect('ejemplo_empleados_pais.db')

#cursor
cursor = conn.cursor()

#Selección datos
cursor.execute("SELECT PAIS, count(PAIS) as count FROM empleados GROUP BY PAIS")

#Dataframe
df = pd.DataFrame(cursor.fetchall(), columns=list(map(lambda x: x[0], cursor.description)))

#Commit
conn.commit()

#Cerrar conexión
conn.close()

df

  PAIS  count
0  BRA      1
1  COL      7
2  ECU      1

###**Restricción al conjunto de resultados - Clausula `HAVING`**

Podemos restringir aun más nuestra busqueda de propietarios por paises. Por ejemplo, podemos limitar la búsqueda para encontrar `n` propietarios de un mismo país. Para esto, usamos la clausula `HAVING`, que se usa en combinación con la clausula `GROUP BY`:

```
SELECT Pais, count(Pais) as count FROM propietarios GROUP BY Pais HAVING count(Pais)>4
```

para obtener a la salida

```
Pais          COUNT
--------- ---------
Colombia          5

```

In [46]:
import sqlite3

#conexión

conn = sqlite3.connect('ejemplo_empleados_pais.db')

#cursor
cursor = conn.cursor()

#Selección datos
cursor.execute("SELECT PAIS, count(PAIS) as count FROM empleados GROUP BY PAIS HAVING count(PAIS)>=2")

#Dataframe
df = pd.DataFrame(cursor.fetchall(), columns=list(map(lambda x: x[0], cursor.description)))

#Commit
conn.commit()

#Cerrar conexión
conn.close()

df

  PAIS  count
0  COL      7

##**TALLER de operaciones avanazas de bases de datos:**

Cree la siguiente base de datos en `sqlit3` de pacientes de un hospital. Cuan este ingresa al hospital, se registra en una base de datos la siguiente información:

- NOMBRE
- APELLIDO
- CEDULA
- EDAD
- MOTIVO DE INGRESO: suponga los siguientes tres casos:
  - Enfemedad cardiaca (EC)
  - Enfermedad respiratoria (ER)
  - Enfermedades Hepáticas (EH)
  - Otras Enfermedades (EV)

Implemente diferentes operaciones avanzadas para, por ejemplo:

1. Determinar los pacientes mayores de cierta edad.
2. Hacer un conteo de pacientes por enfermedad.
3. Filtrar los pacientes por nombre.
4. Encontrar pacientes por número de cédula.
5. Encontrar pacientes que empiecen su apellido por una letra dada.

In [ ]:
#@title **Base de datos a implementar**
import random
import pandas as pd

Nombre = ['Sara', 'David', 'Paola', 'Dario', 'Gabriel', 'Adrian','Pamela','Gina','Laura', 'Carla',
          'Paola','Beatriz','Carlos','Andres','Fabian','Maria','Alejandra','Camilo','Juan', 'Andrea',
          'Luisa','Fernanda', 'Armando', 'Jaime','Leon','Luis','Marina','Fabiola','Hernan','John', 'Hanna',
          'Matias', 'Susana', 'Patricia','Cristina','Paula','Catalina','Ana','Orlando','Oscar','Rubiela',
          'Valeria','Esther','Alejandro','Ramiro','Albeiro','Ivan', 'Nora','Helena','Ulises','Lucia',
          'Mariana','Raquel','Samuel','Leticia','Margarita','Antonio','José','Eugenia','Eduardo','Ursula']

Enfermedades = ['EC','EC','EC','EC','EC','EC','EC','EC','EC','EC','EC','EC','EC','EC','EC','EC','EC','EC','EC','EC',
'ER','ER','ER','ER','ER','ER','ER','ER','ER','ER','ER','ER','ER','ER','ER','ER','ER','ER','ER','ER','ER','ER','ER','ER','ER','ER','ER'
,'EH','EH','EH','EH','EH','EH','EH','EH','EH','EH','EH','EH','EH', 'EV','EV','EV','EV','EV','EV','EV','EV','EV','EV','EV','EV','EV']

Apellidos = ['Gonzalez','Rodriguez','Gomez','Fernandez','Lopez','Diaz','Martinez','Perez','Garcia', 'Sanchez', 'Romero', 'Sosa', 'Torres',
             'Alvarez','Ruiz','Ramirez','Flores','Benitez','Acosta','Medina','Herrera','Suarez','Aguirre','Gimenez','Gutierrez','Pereira',
             'Rojas','Molina','Castro','Ortiz','Domingo','Silva','Luna','Juarez','Cabrera','Rios','Morales','Godoy','Ferreira','Dominguez',
             'Carrizo','Peralta','Castillo','Ledesma','Quiroga','Vega','Vera','Muñoz']

random.shuffle(Nombre)
random.shuffle(Enfermedades)
random.shuffle(Apellidos)

data = [Nombre[:30],Apellidos[:30],list(np.random.randint(8000000,1200000000,30)),list(np.random.randint(12,88,30)),Enfermedades[:30]]
cols = ['NOMBRE','APELLIDO','CEDULA','EDAD','MOTINGRESO']

df = pd.DataFrame(data)
df = df.transpose()
df.columns=cols
df

#**F. Operaciones con Varias Tablas**

En esta sección se abarcarán los siguientes objetivos:

- Definición de Fusión (Join)
- Definición de intersección (Inner Join)
- Definición de Fusión exterior Izquierda (Left Outer Join)
- Definición de Fusión exterior Derecha (Right )
- Definición de Fusión Completa

##**1. Generalidades del JOIN**

Imaginemos que tenemos el siguiente diagrama Entidad-Relación para una base de datos de una librería. 

<center>
    <img height="600px" src="https://github.com/ssanchezgoe/flask_vscode_tutorial/blob/master/imagenes/libreria_ERD.png?raw=true" />
</center>

**Problema:** Consultar  qué prestamista tiene qué copia de un libro que está en prestamo. 

---
**Unión de tablas:** Hablamos de unión de tablas, u operaciones de unión, cuando pretendemos obtener información de dos o más tablas que están relacionadas.

---


Para este problema debemos consular tres tablas:

- Tabla de Prestamista
- Tabla de Prestamo
- Tabla de Copia

En este caso es cuando debemos usar el operador `JOIN`, para combinar datos de más de una tabla, basándonos en las relación entre ciertas columnas de la tabla. Lo primero que debemos hacer en este caso, es idetificar las relaciones entree las tablas, dadas por las columnas correspondientes a las claves foráneas.  

Retomando nuestro problema, si queremos saber qué *prestamista* tiene un *libro*, recopilariamos los datos de las tablas *Prestamita* y *Prestamo*. De ambas tablas necesitaríamos entonces `ID_Prestamista`.

Para hacer estas operaciones, SQL nos ofrece varias operaciones:



<center>
    <img height="600px" src="https://raw.githubusercontent.com/ssanchezgoe/flask_vscode_tutorial/6ebc65fd18150289b3559cb0c54e41e15f1f8888/imagenes/SQL_Joins.svg" />
</center>

##**2. Inner Join**

En esta sección se abordarán los siguientes conceptos:

- Sintáxis de SQL para la union de dos o más tablas.
- Interpretación de resultados.

###**Operación Unión-intersección**

En diagramas de Benn, la unión intersección se representa de la siguiente forma


<center>
    <img height="150px" src="https://github.com/ssanchezgoe/flask_vscode_tutorial/blob/master/imagenes/inner_join.png?raw=true" />
</center>

Recordemos el diagrama ER de la base de datos de una librería que estamos programando:

<center>
    <img height="600px" src="https://github.com/ssanchezgoe/flask_vscode_tutorial/blob/master/imagenes/libreria_ERD.png?raw=true" />
</center>

Si queremos corroborar los nombres de las personas que efectivamente tienen prestado un libro, tendremos que consultar la información que está en dos tablas: la de Prestamista y la de Prestamo. 


- Entidad Prestamista

ID_Prestamista | Apellido | Nombre | e-mail | Telefono | Direccion |Ciudad | COL
-- | -- | -- | -- | -- | -- | -- | --
1 | Sanchez | Sebastian | e-mail | 1111111 | patio lindo 3 |Medellin | COL
2 | Garcia | Natalia | e-mail | 2222222 | villatina 4 |Bogota | COL
3 | Peña | Alberto | e-mail | 3333333 | alborada 5 |San Andres | COL
4 | Nieto | Carmen | e-mail | 4444444 | turpiales 4 |Valledupar | COL
5 | Gomez | Pablo | e-mail | 5555555 | cardenal 6 |Cali | COL
6 | Jaramillo | Daniela | e-mail | 6666666 | caracoli 3 |Barranquilla | COL

- Entidad Prestamo

ID_Prestamo | ID_Copia | ID_Prestamista | Fecha_Prestamo | Dias_prestamo | Fecha_Devolucion
-- | -- | -- | -- | -- | -- 
1 | 1 | 1 | 2019-11-02 | 2|2019-15-02
2 | 2 | 1 | 2019-11-02 | 2|2019-15-02
3 | 3 | 2 | 2019-11-02 | 2|2019-15-02
4 | 4 | 4 | 2019-12-02 |1 |2019-16-02
5| 5 | 5 | 2019-12-02 | 1|2019-16-02 
6 | 6 | 6 | 2019-13-02 |0 |2019-17-02

Si hacemos un `Inner Join` entre estas dos tablas, obtendremos que los Prestamistas que tienen libros prestados son

- 1-Sebastian Sanchez
- 1-Sebastian Sanchez
- 2-Natalia Garcia
- 4-Carmen Nieto
- 5-Pablo Gomez
- 6-Daniela Jaramillo

Es decir, la intersección de los ID_Prestamistas de ambas tablas.

En SQL, esta instrucción se daría de la siguiente forma

```
SELECT PTA.ID_Prestamista PTA.Apellido, PTA.Pais, 
PMO.ID_Prestamista, PMO.Fecha_Devolucion 
FROM Prestamista PTA INNER JOIN Prestamo PMO
ON PTA.ID_Prestamista = PMO.ID_Prestamista
``` 

Veamos un ejemplo de una ejecución usando librerías de `Pandas` en `python`:

In [ ]:
#@title **TABLA Prestamista**

import pandas as pd
import numpy as np

PTA_entries = {'ID_Prestamista':np.arange(1,10),
               'Apellido':['Zuluaga','Arteaga','Londoño','Camargo','Lopez','Sarmiento','Pineda','Velez','Jaimes'],
               'Nombre':['Andres','Sara','Estefania','Daniela','Paola','Esther','Carlos','Esteban','Fernando'],
               'Correo':['aa@corre.com','bb@corre.com','cc@corre.com','dd@corre.com','ee@corre.com','ff@corre.com','gg@corre.com','hh@corre.com','ii@corre.com'],
               'Telefono':['1111111','2222222','3333333','4444444','5555555','6666666','7777777','8888888','9999999'],
               'Dirección':['a1','b2','c3','d4','e5','f6','g7','h8','i9'],
               'Ciudad':['Medellín','Cali','Barranquilla','Cali','Cartagena','Medellín','Bogotá','Pereira','Manizalez'],
               'Pais':['COL','COL','COL','COL','COL','COL','COL','COL','COL']
}

df_PTA = pd.DataFrame(PTA_entries)
df_PTA

   ID_Prestamista   Apellido     Nombre  ... Dirección        Ciudad Pais
0               1    Zuluaga     Andres  ...        a1      Medellín  COL
1               2    Arteaga       Sara  ...        b2          Cali  COL
2               3    Londoño  Estefania  ...        c3  Barranquilla  COL
3               4    Camargo    Daniela  ...        d4          Cali  COL
4               5      Lopez      Paola  ...        e5     Cartagena  COL
5               6  Sarmiento     Esther  ...        f6      Medellín  COL
6               7     Pineda     Carlos  ...        g7        Bogotá  COL
7               8      Velez    Esteban  ...        h8       Pereira  COL
8               9     Jaimes   Fernando  ...        i9     Manizalez  COL

[9 rows x 8 columns]

In [ ]:
#@title **TABLA Prestamo**

import pandas as pd
import numpy as np

PMO_entries = {'ID_Prestamista':np.arange(1,5),
               'ID_Copia':[1,2,3,4,5],
               'ID_Prestamista':[1,2,3,2,3],
               'Fecha_Prestamo':['2020-01-01','2020-01-01','2020-01-01','2020-01-02','2020-01-02'],
               'Dias_Prestamos':[2,2,2,1,1],
               'Fecha_Devolucion':['2020-01-05','2020-01-05','2020-01-05','2020-01-06','2020-01-06']
}

df_PMO = pd.DataFrame(PMO_entries)
df_PMO

   ID_Prestamista  ID_Copia Fecha_Prestamo  Dias_Prestamos Fecha_Devolucion
0               1         1     2020-01-01               2       2020-01-05
1               2         2     2020-01-01               2       2020-01-05
2               3         3     2020-01-01               2       2020-01-05
3               2         4     2020-01-02               1       2020-01-06
4               3         5     2020-01-02               1       2020-01-06

In [ ]:
#@title **INNER JOIN**
df_PTA.merge(df_PMO, on='ID_Prestamista', how='inner')

   ID_Prestamista Apellido  ... Dias_Prestamos Fecha_Devolucion
0               1  Zuluaga  ...              2       2020-01-05
1               2  Arteaga  ...              2       2020-01-05
2               2  Arteaga  ...              1       2020-01-06
3               3  Londoño  ...              2       2020-01-05
4               3  Londoño  ...              1       2020-01-06

[5 rows x 12 columns]

**Problema:** Suponga que tenemos dos bases de datos:

- A: Tabla de estados de una tarjeta de crédito.
- B: Transacciones.

Las tablas se presentan a continuación:

In [ ]:
#@title **Tabla-Entidad tarjetas**
import pandas as pd

tarjetas = pd.read_csv("https://raw.githubusercontent.com/diplomado-bigdata-machinelearning-udea/Curso1/master/s04/ESTADO_201709.txt", sep='|')
tarjetas.sort_values(by=['ID']).head(10)

      ID FRANQUICIA  ... CODIGO VENDEDOR  CODIGO ESTADO TARJETA
778    1          A  ...            6817                      0
6327   2          C  ...               0                      0
6167   3          B  ...               0                      1
3850   4          B  ...               0                      0
6301   5          C  ...               0                      0
5935   6          B  ...            3779                      0
7851   7          C  ...           13099                      0
4677   8          B  ...           35397                      1
3681   9          B  ...               0                      0
2355  10          A  ...            2018                      1

[10 rows x 12 columns]

In [ ]:
#@title **Tabla-Entidad transacciones**
import pandas as pd

transacciones = pd.read_csv("https://raw.githubusercontent.com/diplomado-bigdata-machinelearning-udea/Curso1/master/s04/TRANSACCION_201709.txt", sep='|')
transacciones.sort_values(by=['ID']).head(10)

    ID  NUMERO TARJETA  ...  VALOR TRANSACCION NUMERO CUOTAS DIFERIDAS
0    1            1682  ...           137373.0                       0
1    1            1682  ...            14500.0                       1
2    1            1682  ...            17340.0                       0
3    2            6338  ...           508999.0                       0
4    2            6338  ...           170000.0                       1
5    3            5811  ...            63500.0                       0
6    4            3801  ...            61000.0                       0
12   5            6340  ...            15700.0                       1
11   5            6340  ...           143900.0                       1
10   5            6340  ...           646141.0                       0

[10 rows x 6 columns]

In [ ]:
#@title **¿Cómo podría obtener información de las tarjetas que han realizado alguna transacción? Suponga que quiere recuperar todas las filas de las tablas tarjetas y transacciones**

arg = "No es posible realizar dicha operacion" #@param ["No es posible realizar dicha operacion", "SELECT * FROM tarjetas ta INNER JOIN transacciones tr ON ta.ID = tr.ID", "SELECT ID FROM tarjetas ta INNER JOIN transacciones tr ON ta.ID = tr.ID","SELECT ALL FROM tarjetas ta INNER JOIN transacciones tr ON ta.ID = tr.ID"]

if arg == "SELECT * FROM tarjetas ta INNER JOIN transacciones tr ON ta.ID = tr.ID":
  print("Respuesta correcta!, la operación resultante sería: \n")
  print(tarjetas.merge(transacciones, on = 'ID', how='inner').sort_values(by=['ID']).head(10))
else:
  print("Respuesta incorrecta.")

###**3. LEFT Outer Join**

En un diagrama de Benn, la operación de `LEFT OUTER JOIN`

<center>
    <img height="150px" src="https://github.com/ssanchezgoe/flask_vscode_tutorial/blob/master/imagenes/left_outer_join.png?raw=true" />
</center>

En este sentido, una operación de este tipo toma todas las entradas que concuerdan A y las combina con aquellas que concuerdan en B. 


En `SQL` la sintaxis sería:

```
SELECT PTA.ID_Prestamista, PTA.Apellido, PTA.Pais, PMO.ID_Prestamista, PMO.Fecha_Prestamo  
FROM Prestamista PTA LEFT JOIN Prestamo PMO 
ON PTA.ID_Prestamista = PMO.Prestamista
```

In [ ]:
#@title **TABLA Prestamista**

import pandas as pd
import numpy as np

PTA_entries = {'ID_Prestamista':np.arange(1,10),
               'Apellido':['Zuluaga','Arteaga','Londoño','Camargo','Lopez','Sarmiento','Pineda','Velez','Jaimes'],
               'Nombre':['Andres','Sara','Estefania','Daniela','Paola','Esther','Carlos','Esteban','Fernando'],
               'Correo':['aa@corre.com','bb@corre.com','cc@corre.com','dd@corre.com','ee@corre.com','ff@corre.com','gg@corre.com','hh@corre.com','ii@corre.com'],
               'Telefono':['1111111','2222222','3333333','4444444','5555555','6666666','7777777','8888888','9999999'],
               'Dirección':['a1','b2','c3','d4','e5','f6','g7','h8','i9'],
               'Ciudad':['Medellín','Cali','Barranquilla','Cali','Cartagena','Medellín','Bogotá','Pereira','Manizalez'],
               'Pais':['COL','COL','COL','COL','COL','COL','COL','COL','COL']
}

df_PTA = pd.DataFrame(PTA_entries)
df_PTA

   ID_Prestamista   Apellido     Nombre  ... Dirección        Ciudad Pais
0               1    Zuluaga     Andres  ...        a1      Medellín  COL
1               2    Arteaga       Sara  ...        b2          Cali  COL
2               3    Londoño  Estefania  ...        c3  Barranquilla  COL
3               4    Camargo    Daniela  ...        d4          Cali  COL
4               5      Lopez      Paola  ...        e5     Cartagena  COL
5               6  Sarmiento     Esther  ...        f6      Medellín  COL
6               7     Pineda     Carlos  ...        g7        Bogotá  COL
7               8      Velez    Esteban  ...        h8       Pereira  COL
8               9     Jaimes   Fernando  ...        i9     Manizalez  COL

[9 rows x 8 columns]

In [ ]:
#@title **TABLA Prestamo**

import pandas as pd
import numpy as np

PMO_entries = {'ID_Prestamista':np.arange(1,5),
               'ID_Copia':[1,2,3,4,5],
               'ID_Prestamista':[1,2,3,2,3],
               'Fecha_Prestamo':['2020-01-01','2020-01-01','2020-01-01','2020-01-02','2020-01-02'],
               'Dias_Prestamos':[2,2,2,1,1],
               'Fecha_Devolucion':['2020-01-05','2020-01-05','2020-01-05','2020-01-06','2020-01-06']
}

df_PMO = pd.DataFrame(PMO_entries)
df_PMO

   ID_Prestamista  ID_Copia Fecha_Prestamo  Dias_Prestamos Fecha_Devolucion
0               1         1     2020-01-01               2       2020-01-05
1               2         2     2020-01-01               2       2020-01-05
2               3         3     2020-01-01               2       2020-01-05
3               2         4     2020-01-02               1       2020-01-06
4               3         5     2020-01-02               1       2020-01-06

In [ ]:
#@title **LEFT OUTER JOIN: Prestamista- Tabla Izquiera**

df_PTA.merge(df_PMO, on='ID_Prestamista', how='left')

    ID_Prestamista   Apellido  ... Dias_Prestamos Fecha_Devolucion
0                1    Zuluaga  ...            2.0       2020-01-05
1                2    Arteaga  ...            2.0       2020-01-05
2                2    Arteaga  ...            1.0       2020-01-06
3                3    Londoño  ...            2.0       2020-01-05
4                3    Londoño  ...            1.0       2020-01-06
5                4    Camargo  ...            NaN              NaN
6                5      Lopez  ...            NaN              NaN
7                6  Sarmiento  ...            NaN              NaN
8                7     Pineda  ...            NaN              NaN
9                8      Velez  ...            NaN              NaN
10               9     Jaimes  ...            NaN              NaN

[11 rows x 12 columns]

**Problema:** Si tenemos las dos siguientes tablas

- Posibles usuarios que pueden o no realizar compras de una tienda.
- transacciones 

las cuales se presentan a continuación:

In [ ]:
#@title **Entidad usuarios**
import numpy as np
import pandas as pd

# usuarios
usuarios = pd.DataFrame({'ID_Usr': [1,2,3,4], 
                         'Name':['Pablo', 'Maria', 'John', 'Ana'],
                     'Phone': ['1111111', '2111111', '3111111', 
                                        np.NaN]})

usuarios

   ID_Usr   Name    Phone
0       1  Pablo  1111111
1       2  Maria  2111111
2       3   John  3111111
3       4    Ana      NaN

In [ ]:
#@title **Entidad transacciones**
import numpy as np
import pandas as pd

# transactions
transacciones = pd.DataFrame({'ID_Tr': [1, 2, 3, 4], 
                    'ID_Usr': [1, 3, 3, 4],
                    'Value': np.arange(1000,5000,1000),
                   })
transacciones

   ID_Tr  ID_Usr  Value
0      1       1   1000
1      2       3   2000
2      3       3   3000
3      4       4   4000

In [ ]:
#@title **¿Cómo podría realizar una búsqueda haciendo un LEFT JOIN, para que aparezcan el nombre, los telefonos y el valor de la compra de las personas que comparon en la tienda?**

arg = "SELECT usr.Name, usr.Phone, tr.Value FROM transacciones tr LEFT JOIN usuarios usr ON tr.ID_Usr = usr.ID_Usr" #@param ["SELECT * FROM transacciones tr LEFT JOIN usuarios usr ON tr.ID_usr = urs.ID_Usr", "No es posible realizar dicha operacion con LEFT JOIN", "SELECT usr.Name, usr.Phone, tr.Value FROM usuarios usr LEFT JOIN transacciones tr ON usr.ID_usr = tr.ID_usr" ,"SELECT usr.Name, usr.Phone, tr.Value FROM transacciones tr LEFT JOIN usuarios usr ON tr.ID_Usr = usr.ID_Usr"]

if arg == "SELECT usr.Name, usr.Phone, tr.Value FROM transacciones tr LEFT JOIN usuarios usr ON tr.ID_Usr = usr.ID_Usr":
  
  print("Respuesta Correcta!\n")
  print(transacciones.merge(usuarios, on='ID_Usr', how='left')[['Name','Phone','Value']])
else:
  print("Respuesta incorrecta.")

###**3. RIGTH Outer Join**

En un diagrama de Benn, un `RIGHT OUTER JOIN` se representa como

<center>
    <img height="150px" src="https://github.com/ssanchezgoe/flask_vscode_tutorial/blob/master/imagenes/right_outer_join.png?raw=true" />
</center>

En este sentido, una operación de este tipo toma todas las entradas que de B y las combina con aquellas que concuerdan en A.


En `SQL` la sintaxis sería:

```
SELECT PTA.ID_Prestamista, PTA.Apellido, PTA.Pais, PMO.ID_Prestamista, PMO.Fecha_Prestamo  
FROM Prestamista PTA LEFT JOIN Prestamo PMO 
ON PTA.ID_Prestamista = PMO.Prestamista
```

In [ ]:
#@title **TABLA Prestamista**

import pandas as pd
import numpy as np

PTA_entries = {'ID_Prestamista':np.arange(1,10),
               'Apellido':['Zuluaga','Arteaga','Londoño','Camargo','Lopez','Sarmiento','Pineda','Velez','Jaimes'],
               'Nombre':['Andres','Sara','Estefania','Daniela','Paola','Esther','Carlos','Esteban','Fernando'],
               'Correo':['aa@corre.com','bb@corre.com','cc@corre.com','dd@corre.com','ee@corre.com','ff@corre.com','gg@corre.com','hh@corre.com','ii@corre.com'],
               'Telefono':['1111111','2222222','3333333','4444444','5555555','6666666','7777777','8888888','9999999'],
               'Dirección':['a1','b2','c3','d4','e5','f6','g7','h8','i9'],
               'Ciudad':['Medellín','Cali','Barranquilla','Cali','Cartagena','Medellín','Bogotá','Pereira','Manizalez'],
               'Pais':['COL','COL','COL','COL','COL','COL','COL','COL','COL']
}

df_PTA = pd.DataFrame(PTA_entries)
df_PTA

   ID_Prestamista   Apellido     Nombre  ... Dirección        Ciudad Pais
0               1    Zuluaga     Andres  ...        a1      Medellín  COL
1               2    Arteaga       Sara  ...        b2          Cali  COL
2               3    Londoño  Estefania  ...        c3  Barranquilla  COL
3               4    Camargo    Daniela  ...        d4          Cali  COL
4               5      Lopez      Paola  ...        e5     Cartagena  COL
5               6  Sarmiento     Esther  ...        f6      Medellín  COL
6               7     Pineda     Carlos  ...        g7        Bogotá  COL
7               8      Velez    Esteban  ...        h8       Pereira  COL
8               9     Jaimes   Fernando  ...        i9     Manizalez  COL

[9 rows x 8 columns]

In [ ]:
#@title **TABLA Prestamo**

import pandas as pd
import numpy as np

PMO_entries = {'ID_Prestamista':np.arange(1,5),
               'ID_Copia':[1,2,3,4,5],
               'ID_Prestamista':[1,1,1,2,3],
               'Fecha_Prestamo':['2020-01-01','2020-01-01','2020-01-01','2020-01-02','2020-01-02'],
               'Dias_Prestamos':[2,2,2,1,1],
               'Fecha_Devolucion':['2020-01-05','2020-01-05','2020-01-05','2020-01-06','2020-01-06']
}

df_PMO = pd.DataFrame(PMO_entries)
df_PMO

   ID_Prestamista  ID_Copia Fecha_Prestamo  Dias_Prestamos Fecha_Devolucion
0               1         1     2020-01-01               2       2020-01-05
1               1         2     2020-01-01               2       2020-01-05
2               1         3     2020-01-01               2       2020-01-05
3               2         4     2020-01-02               1       2020-01-06
4               3         5     2020-01-02               1       2020-01-06

In [ ]:
#@title **RIGTH OUTER JOIN: Prestamo (Derecha)**

df_PTA.merge(df_PMO, on='ID_Prestamista', how='right')

   ID_Prestamista Apellido  ... Dias_Prestamos Fecha_Devolucion
0               1  Zuluaga  ...              2       2020-01-05
1               1  Zuluaga  ...              2       2020-01-05
2               1  Zuluaga  ...              2       2020-01-05
3               2  Arteaga  ...              1       2020-01-06
4               3  Londoño  ...              1       2020-01-06

[5 rows x 12 columns]

**Problema:** Si tenemos las dos siguientes tablas

- Posibles usuarios que pueden o no realizar compras de una tienda.
- transacciones 

las cuales se presentan a continuación:

In [ ]:
#@title **Entidad usuarios**
import numpy as np
import pandas as pd

# usuarios
usuarios = pd.DataFrame({'ID_Usr': [1,2,3,4], 
                         'Name':['Pablo', 'Maria', 'John', 'Ana'],
                     'Phone': ['1111111', '2111111', '3111111', 
                                        np.NaN]})

usuarios

   ID_Usr   Name    Phone
0       1  Pablo  1111111
1       2  Maria  2111111
2       3   John  3111111
3       4    Ana      NaN

In [ ]:
#@title **Entidad transacciones**
import numpy as np
import pandas as pd

# transactions
transacciones = pd.DataFrame({'Tr_ID': [1, 2, 3, 4], 
                    'ID_Usr': [1, 3, 3, 4],
                    'Value': np.arange(1000,5000,1000),
                   })
transacciones

   Tr_ID  ID_Usr  Value
0      1       1   1000
1      2       3   2000
2      3       3   3000
3      4       4   4000

In [ ]:
#@title **¿Cómo podría realizar una búsqueda haciendo un RIGHT JOIN, para que aparezcan el nombre, los telefonos y el valor de la compra de las personas que comparon en la tienda?**

arg = "SELECT usr.Name, usr.Phone, tr.Value FROM usuarios usr RIGHT JOIN transacciones tr ON usr.ID_Usr = tr.ID_Usr" #@param ["SELECT * FROM transacciones tr RIGHT JOIN usuarios usr ON tr.ID_Usr = urs.ID_Usr", "No es posible realizar dicha operacion con RIGHT JOIN", "SELECT usr.Name, usr.Phone, tr.Value FROM usuarios usr RIGHT JOIN transacciones tr ON usr.ID_Usr = tr.ID_Usr" ,"SELECT usr.Name, usr.Phone, tr.Value FROM transacciones tr RIGHT JOIN usuarios usr ON tr.ID_Usr = usr.ID_Usr"]

if arg == "SELECT usr.Name, usr.Phone, tr.Value FROM usuarios usr RIGHT JOIN transacciones tr ON usr.ID_Usr = tr.ID_Usr":
  print("Respuesta Correcta!\n")
  print(usuarios.merge(transacciones, on='ID_Usr', how='right')[['Name','Phone','Value']])
else:
  print("Respuesta incorrecta.")

Respuesta Correcta!

    Name    Phone  Value
0  Pablo  1111111   1000
1   John  3111111   2000
2   John  3111111   3000
3    Ana      NaN   4000

###**4. FULL Outer Join**

In [ ]:
#@title **TABLA Prestamista**

import pandas as pd
import numpy as np

PTA_entries = {'ID_Prestamista':np.arange(1,10),
               'Apellido':['Zuluaga','Arteaga','Londoño','Camargo','Lopez','Sarmiento','Pineda','Velez','Jaimes'],
               'Nombre':['Andres','Sara','Estefania','Daniela','Paola','Esther','Carlos','Esteban','Fernando'],
               'Correo':['aa@corre.com','bb@corre.com','cc@corre.com','dd@corre.com','ee@corre.com','ff@corre.com','gg@corre.com','hh@corre.com','ii@corre.com'],
               'Telefono':['1111111','2222222','3333333','4444444','5555555','6666666','7777777','8888888','9999999'],
               'Dirección':['a1','b2','c3','d4','e5','f6','g7','h8','i9'],
               'Ciudad':['Medellín','Cali','Barranquilla','Cali','Cartagena','Medellín','Bogotá','Pereira','Manizalez'],
               'Pais':['COL','COL','COL','COL','COL','COL','COL','COL','COL']
}

df_PTA = pd.DataFrame(lib_entries)
df_PTA

   ID_Prestamista   Apellido     Nombre  ... Dirección        Ciudad Pais
0               1    Zuluaga     Andres  ...        a1      Medellín  COL
1               2    Arteaga       Sara  ...        b2          Cali  COL
2               3    Londoño  Estefania  ...        c3  Barranquilla  COL
3               4    Camargo    Daniela  ...        d4          Cali  COL
4               5      Lopez      Paola  ...        e5     Cartagena  COL
5               6  Sarmiento     Esther  ...        f6      Medellín  COL
6               7     Pineda     Carlos  ...        g7        Bogotá  COL
7               8      Velez    Esteban  ...        h8       Pereira  COL
8               9     Jaimes   Fernando  ...        i9     Manizalez  COL

[9 rows x 8 columns]

In [ ]:
#@title **TABLA Prestamo**

import pandas as pd
import numpy as np

PMO_entries = {'ID_Prestamista':np.arange(1,5),
               'ID_Copia':[1,2,3,4,5],
               'ID_Prestamista':[1,1,1,2,3],
               'Fecha_Prestamo':['2020-01-01','2020-01-01','2020-01-01','2020-01-02','2020-01-02'],
               'Dias_Prestamos':[2,2,2,1,1],
               'Fecha_Devolucion':['2020-01-05','2020-01-05','2020-01-05','2020-01-06','2020-01-06']
}

df_PMO = pd.DataFrame(PMO_entries)
df_PMO

   ID_Prestamista  ID_Copia Fecha_Prestamo  Dias_Prestamos Fecha_Devolucion
0               1         1     2020-01-01               2       2020-01-05
1               1         2     2020-01-01               2       2020-01-05
2               1         3     2020-01-01               2       2020-01-05
3               2         4     2020-01-02               1       2020-01-06
4               3         5     2020-01-02               1       2020-01-06

In [ ]:
#@title **LEFT OUTER JOIN: Prestamista (Izquiera)**

df_PTA.merge(df_PMO, on='ID_Prestamista', how='outer')

    ID_Prestamista   Apellido  ... Dias_Prestamos Fecha_Devolucion
0                1    Zuluaga  ...            2.0       2020-01-05
1                1    Zuluaga  ...            2.0       2020-01-05
2                1    Zuluaga  ...            2.0       2020-01-05
3                2    Arteaga  ...            1.0       2020-01-06
4                3    Londoño  ...            1.0       2020-01-06
5                4    Camargo  ...            NaN              NaN
6                5      Lopez  ...            NaN              NaN
7                6  Sarmiento  ...            NaN              NaN
8                7     Pineda  ...            NaN              NaN
9                8      Velez  ...            NaN              NaN
10               9     Jaimes  ...            NaN              NaN

[11 rows x 12 columns]

#**G. SQL en `python`**

Existen varias formas de usar SQL en `python` a través de los diferentes sistemas de gestión de bases de datos relacionales existentes (RDBMS - Relational Database Managment Systems). En este sentido la siguiente tabla muestra el sistema de gestión de bases de datos y su respectivo paquete en `python`

RDBMS | Paquete python
--|--
postgresql | `py-postgresql`
MySQL | `MySQL-python`
Oracle | `cx-Oracle`
SQLite | `sqlite3`



Un paquete sumamente útil para el desarrollo de apps que integra estos RDBMS es `SQLAlchemy`, el cual es bastante flexible al proporcionarnos dos modos principales de uso:

- Expresiones de lenguaje SQL (conmunmente conocido como Core)
- Mapeo objeto-relación (ORM- Object Relation Mapping).

Estos modos pueden ser usados de forma separada o junta, dependiendo de las preferencias y necesidad de la app a desarrollar.

##**Introducción a `SQLAlchemy`**


Dentro de los DDLs/DMLs soportados por `SQLAlchemy` se encuentran:

- Firebird
- Microsoft SQL Server
- MySQL
- Oracle
- PostgreSQL
- SQLite
- Sybase

Pudiéndose operar con instrucciones parecidas a `SQL` desde `python`.

**NOTA:** A lo largo del presente móulo trabajaremos con el RDBMS de `SQLite` incluido en `SQLAlchemy`.

---

**SQLite:** La mayoria de motores de bases de datos SQL se implementan como un proceso de servidor independiente, en donde los programas, par acceder a la base de datos, se comunican con el servidor mediante un tipo de comunicación entre procesos (TCP/IP), para enviar solicitudes al servidor y recibir resultados. SQLite no funciona de esta forma. En SQLitel, el proceso que quiere acceder a la base de datos lee y escribe directamente desde los archivos de la base de datos en el disco, es decirm no hay un proceso de servidor intermediario.

No tener servidor tiene ciertas ventajas, la principal es que no hay un proceso de servidor separado para instalar, configurar, inicializar, administrar y solucionar problemas. Esta es una de las razones por las que SQLite es un motor de base de datos de "configuración cero". Los programas que usan SQLite no requieren soporte administrativo para configurar el motor de la base de datos antes de ejecutarse. Cualquier programa que pueda acceder al disco puede utilizar una base de datos SQLite.

Por otro lado, un motor de base de datos que usa un servidor puede brindar una mejor protección contra errores en la aplicación cliente; los punteros perdidos en un cliente no pueden dañar la memoria del servidor. Y debido a que un servidor es un proceso único y persistente, puede controlar el acceso a la base de datos con más precisión, lo que permite un bloqueo más detallado y una mejor concurrencia.

La mayoría de los motores de bases de datos SQL están basados ​​en cliente/servidor. De los que no tienen servidor, SQLite es el único conocido por este autor que permite que múltiples aplicaciones accedan a la misma base de datos al mismo tiempo.

---

##**`SQLALchemy` core y Expresiones del lenguaje SQL**

Las expresiones de lenguaje SQL es una forma pythonica de representar instrucciones y expresiones comunes de SQL, que en últimas representa una abastracción simple del lenguaje SQL. Se encfoca en el esquema real de una base de datos; no obstante, está estandarizado de tal forma que proporciona un lenguaje consistente en varios backends de bases de datos. Las expresiones del lenguaje `SQL` tambien actuan como los fundamentos del ORM de SQLAlchemy.

El ORM se centra en el modelo de dominio de la aplicación y aprovecha el patrón de unidad de trabajo para mantener el estado del objeto.

##**ORM de `SQLAlchemy`**

Por lo general, el sistema de tipos utilizado en un lenguaje orientado a objetos (OO) como Python contiene tipos no escalares. Estos no se pueden expresar como tipos primitivos, es decir, como enteros y cadenas. Por lo tanto, el programador tiene que convertir estos objetos en datos escalares para interactuar con la base de datos backend. Sin embargo, los tipos de datos en la mayoría de los productos de bases de datos, como Oracle, MySQL, etc., son primitivos.

En un sistema ORM, cada clase se asigna a una tabla en la base de datos subyacente. En lugar de escribir usted mismo el código de interfaz de la base de datos, un ORM se encarga de esto.

Un ORM se centra en el dominio del modelo de la aplicación y aprovecha el patrón de unidad de trabajo (la base de datos, en nuestro caso) para mantener el estado del objeto. Un ORM, proporciona tambien una abstración de alto nivel sobre el lenguaje de expresiones de `SQL` que le permite al usuario trabajar con el lenguaje de programación que esté más familiarizado; de hecho, podemos mezclar y combinar el uso de ORM con el lenguaje de expresiones `SQL` para la creación de apps.

Debemos tener en cuenta que **existe una diferencia entre la forma en que se pueden relacionar las clases y como operan las relaciones de la base de datos subyacente**.

##**Determinación del modo SQLAlchemy**

Al crear una app con SQLAlchemy, se tendrá que deterinar antes si se utilizará principalmente como ORM o Core. La decisión entre elegir usar SQLAlchemy Core o ORM como la capa dominante de acceso a datos para una aplicación a menudo se reduce a algunos factores y preferencias personales. Los dos modos utilizan una sintaxis ligeramente diferente, pero la mayor diferencia entre Core y ORM es la vista de los datos como esquemas u objetos comerciales. SQLAlchemy Core tiene una vista centrada en el esquema, que al igual que el SQL tradicional se centra en tablas, claves y estructuras de índices. SQLAlchemy Core realmente brilla en el almacenamiento de datos, informes, análisis y otros puntos en los que es útil poder controlar estrictamente la consulta u operar con datos no modelados. Tener un grupo de conexiones de base de datos sólido y las optimizaciones de ResultSet son ideales para manejar grandes cantidades de datos incluso en múltiples bases de datos. Sin embargo, si desea centrarse más en un diseño impulsado por dominios, el ORM encapsulará gran parte del esquema y la estructura subyacentes en metadatos y objetos comerciales. Esta encapsulación puede facilitar que las interacciones con la base de datos se sientan más como un código Python normal. La mayoría de las aplicaciones comunes se prestan a ser modeladas en de esta manera. También puede ser una forma muy eficaz de inyectar diseño basado en dominios en una aplicación heredada o en una con sentencias SQL sin procesar esparcidas por todas partes. Los microservicios también se benefician de su abstracción de la base de datos subyacente que permite al desarrollador
céntrese solo en el proceso que se está implementando.
Sin embargo, dado que el ORM está construido sobre SQLAlchemy Core, puede usar su capacidad para trabajar con servicios como Oracle Data Warehousing y Amazon Redshift de la misma manera que interopera con MySQL. Esto lo convierte en un complemento maravilloso para el ORM cuando necesita combinar objetos comerciales y datos almacenados.

- Si está trabajando con un marco que ya tiene un ORM integrado, pero desea agregar informes más potentes, use Core.

- Si no desea tener una vista de sus datos en una vista más centrada en el esquema como se usa en SQL, use Core.

- ¿Tiene datos para los que no se necesitan objetos comerciales? Utilice Core.

- ¿Ve sus datos como objetos comerciales, utiliza ORM?

- ¿Está construyendo un prototipo rápido, use ORM?

- ¿Tiene una combinación de necesidades que realmente puedan aprovechar tanto los objetos de negocio como otros datos no relacionados con el dominio del problema, utilice ambos?

Ahora que sabe cómo está estructurado SQLAlchemy y la diferencia entre Core y ORM, estamos listos para instalar y comenzar a usar SQLAlchemy para conectarnos a una base de datos.

##**`SQLAlchemy` core: Tabla única**

###**Conexión a una base de datos**

La clase `engine` conecta un grupo y un dialecto para proporcionar una medio de conectividad y comportamiento de la base de datos. Se crea una instancia de un objeto de la clase `Engine` mediante el la función `create_engine()`. La sintaxis es la siguiente:

```
from sqlalchemy import create_engine
engine = create_engine(URL)
```

Dicha función recibe un argumento correspondiente a la base de datos, la cual no es necesaria que esté definida en alguna parte. Usualmente, el string al que corresponde el `URL` esta compuesto por el dialecto de la base de datos, además de este argumento, se pueden indicar más argumentos de conexión. Por ejemplo, podemos indicar mediante el flag `echo` la vonfiguración del registro de SQLAlchemy, el cual se logra a través del módulo de registro estándar de `Python`.

```
from sqlalchemy import create_engine
engine = create_engine('sqlite:///college.db', echo = True)
```

La función `create_engine()` nos devuelve un **objeto engine**. Algunos métodos importantes de cla clase `Engine` se resumen en la siguiente tabla:

Método | Descripción
---|---
`connect()`| Ejecuta el objeto conexión.
`execute()`| Ejecuta una construcción de declaración `SQL`.
`begin()`| Devuele un administrador de contexto que entre <br> una conexión con una transacción establecida. Si <br> la operación es exitosa, se confirma la transacción,<br> sino, se revierte.
`dispose()`| Elimina el grupo de conexiones usados por `Engine`.
`driver()`| Nombre del driver del dialecto en uso por `Engine`.
`tables_names()`| Devuelve una lista de todas los nombres de las tablas <br> en la base de datos.
`transaction()`| Ejecuta la función dada dentro de una límite de transacción.

###**Creación de tablas**

La creación de tablas en `SQLAlchemy` está compueta por varias partes:

- Una base de datos está representada por un `Tableobject`
- Un objeto columna representa una columna en una tabla de una base de datos de un `Tableobject`.
- Los metadatos contienen definiciones de tablas y objetos asociados tales como, índices, vistas, triggers, etc. Este tipo de objetos de metadatos se definen mediante la clase `MetaData`, que es una collección de objetos `Table` y del esquema asociado; contiene además, una colección de objetos de tabla, así como un enlace opcional a un `Engine` o `Connection`. `MetaData` se encarga entonces de unir mantener unida la estructura de la base de datos, para accedes rapidamente a ella en `SQLAlchemy`. `MetaData` puede ser pensado como una especie de catalogo de objetos de tablas.

Para crear un objeto de `MetaData` hacemos lo siguiente:

In [ ]:
from sqlalchemy import MetaData
meta = MetaData()
meta

MetaData(bind=None)

Nótese que hasta ahora no está ligado a ninguna base de datos, por lo que no tendrá ningun esquema  asociado. 

El siguiente paso consiste en crear las tablas que comprondrán la base de datos ligadas a metadata, para lo que usamos el constructor `Table`, parecido a la instrcción de `SQL`: `CREATE TABLE`. 

Un objeto de la clase `Table` representa a la tabla un una base de datos. Dicho constructor toma los siguientes parámetros

Nombre | Nombre de la tabla
--|--
`MetaData`| Objeto `MetaData` que contendra la tabla
Columna(s)| Uno o más objetos de la clase `Column`, que <br> representa una columna de la tabla de la base <br> de datos.

El constructor `Table` toma el nombre, el tipo y otros parámetros como `primary_key`, autoincremento y otras restricciones. 

Alguno de los typos genéricos de `SQLAlchemy` usados en los datos de las **columnas** son:

- BigInteger
- Boolean
- Date
- DateTime
- Float
- Integer
- Numeric
- SmallInteger
- String
- Text
- Time

Creemos, por ejemplo, una base de datos que llamaremos **ejemplo_estudiantes.db**:

In [ ]:
from sqlalchemy import create_engine, MetaData, Table, Column, Integer, String
db_name = 'ejemplo_estudiantes.db'
engine = create_engine('sqlite:////content/'+db_name, echo = True)
meta = MetaData()

estudiantes = Table(
   'estudiantes', meta, 
   Column('ID', Integer, primary_key = True), 
   Column('NOMBRE', String), 
   Column('APELLIDO', String),
)

In [ ]:
ls

ejemplo_empleados.db  sample_data/

Nótese que, hasta el momento, no hemos creado la base de datos. Para realizar la tarea de creación usamos la función `create_all()` del objeto `meta` que recibe como objeto el objeto `engine`para crear todos los objetos de tablas y guardar la información en metadatos.

In [ ]:
meta.create_all(engine)

2020-09-01 17:20:48,215 INFO sqlalchemy.engine.base.Engine SELECT CAST('test plain returns' AS VARCHAR(60)) AS anon_1

INFO:sqlalchemy.engine.base.Engine:SELECT CAST('test plain returns' AS VARCHAR(60)) AS anon_1

2020-09-01 17:20:48,218 INFO sqlalchemy.engine.base.Engine ()

INFO:sqlalchemy.engine.base.Engine:()

2020-09-01 17:20:48,221 INFO sqlalchemy.engine.base.Engine SELECT CAST('test unicode returns' AS VARCHAR(60)) AS anon_1

INFO:sqlalchemy.engine.base.Engine:SELECT CAST('test unicode returns' AS VARCHAR(60)) AS anon_1

2020-09-01 17:20:48,224 INFO sqlalchemy.engine.base.Engine ()

INFO:sqlalchemy.engine.base.Engine:()

2020-09-01 17:20:48,227 INFO sqlalchemy.engine.base.Engine PRAGMA main.table_info("estudiantes")

INFO:sqlalchemy.engine.base.Engine:PRAGMA main.table_info("estudiantes")

2020-09-01 17:20:48,233 INFO sqlalchemy.engine.base.Engine ()

INFO:sqlalchemy.engine.base.Engine:()

2020-09-01 17:20:48,235 INFO sqlalchemy.engine.base.Engine PRAGMA temp.table_info("estudiantes")

INFO:sqlalchemy.engine.base.Engine:PRAGMA temp.table_info("estudiantes")

2020-09-01 17:20:48,238 INFO sqlalchemy.engine.base.Engine ()

INFO:sqlalchemy.engine.base.Engine:()

2020-09-01 17:20:48,241 INFO sqlalchemy.engine.base.Engine
CREATE TABLE estudiantes (
	"ID" INTEGER NOT NULL,
	"NOMBRE" VARCHAR,
	"APELLIDO" VARCHAR,
	PRIMARY KEY ("ID")
)

INFO:sqlalchemy.engine.base.Engine:
CREATE TABLE estudiantes (
	"ID" INTEGER NOT NULL,
	"NOMBRE" VARCHAR,
	"APELLIDO" VARCHAR,
	PRIMARY KEY ("ID")
)

2020-09-01 17:20:48,243 INFO sqlalchemy.engine.base.Engine ()

INFO:sqlalchemy.engine.base.Engine:()

2020-09-01 17:20:48,260 INFO sqlalchemy.engine.base.Engine COMMIT

INFO:sqlalchemy.engine.base.Engine:COMMIT

Dado que tenemos activo el atríbuto `echo` al crear el motor, cuando creamos la base de datos, nos muestra la solicitud SQL realizada para la creación de la tabla:

```
CREATE TABLE estudiante (
	id INTEGER NOT NULL, 
	nombre VARCHAR, 
	apellido VARCHAR, 
	PRIMARY KEY (id)
)
```

Verifiquémos que la base de datos halla sido creada:

In [ ]:
ls

ejemplo_empleados.db  ejemplo_estudiantes.db  sample_data/

Dentro del objeto `meta`, encontraremos la función `tables`, donde podemos visualizar la tabla creada:

In [ ]:
meta.tables

immutabledict({'estudiantes': Table('estudiantes', MetaData(bind=None), Column('ID', Integer(), table=<estudiantes>, primary_key=True, nullable=False), Column('NOMBRE', String(), table=<estudiantes>), Column('APELLIDO', String(), table=<estudiantes>), schema=None)})

La base de datos creada no contendrá ninguna entrada, como es de esperarse hasta ahora.

###**Inserción de datos**

Dentro de las operaciones las expresiones de `SQL`, tenemos la operación de insersión de datos `INSERT`. En el caso de `SQLAlchemy`, las expresiones de `SQL` se construyen a través de un metodo perteneciente al objeto `Table` creado. En el caso de la tabla `estudiantes`, la instrucción `INSERT` se crea al ejecutar el método `insert()` de dicha tabla.

Mediante la función predefinida en python `str()`, podemos consultar la instrucción:

In [ ]:
ins = estudiantes.insert().values(NOMBRE='Sebastian',APELLIDO='Sanchez')
str(ins)

'INSERT INTO estudiantes ("NOMBRE", "APELLIDO") VALUES (:NOMBRE, :APELLIDO)'

###**Ejecución de expresiones**

Veamos ahora como ejecutamos la instrucción/expresión de inserción para que tenga lugar el cambio en tabla de la base de datos `estudiantes.db`.


Para ejecutar las expresiones de `SQL`, debemos obtener primero un objeto de conexón que corresponda a un recurso de conexión DBAPI verificado activamente y luego alimentar dicho objeto de expresión.

In [ ]:
conn = engine.connect()

Una vez establecido el objeto de conexión, le pasamos como argumento el objeto `ins` creado, mediante el método `execute()` del objeto de conexión:

In [ ]:
resultado = conn.execute(ins)

2020-09-01 17:21:23,528 INFO sqlalchemy.engine.base.Engine INSERT INTO estudiantes ("NOMBRE", "APELLIDO") VALUES (?, ?)

INFO:sqlalchemy.engine.base.Engine:INSERT INTO estudiantes ("NOMBRE", "APELLIDO") VALUES (?, ?)

2020-09-01 17:21:23,531 INFO sqlalchemy.engine.base.Engine ('Sebastian', 'Sanchez')

INFO:sqlalchemy.engine.base.Engine:('Sebastian', 'Sanchez')

2020-09-01 17:21:23,535 INFO sqlalchemy.engine.base.Engine COMMIT

INFO:sqlalchemy.engine.base.Engine:COMMIT

En este punto, tenedremos almacenado nuestro promer dato de la base de datos de estudiantes:

<center>
    <img height="500px" src="https://github.com/ssanchezgoe/flask_vscode_tutorial/blob/master/imagenes/primeta_entrada_sqlachemy.png?raw=true" />
</center>

La variable `resultado` es conocida como un objeto `ResultProxy`. Es análogo al objeto cursor DBAPI.  Con el objeto `resultado` podemos obtener información de la `primary_key` que se generó:

In [ ]:
resultado.inserted_primary_key

[1]

Agregar instancia por instancia en una base de datos es una tarea infernal. Pordemos hacerlo en una sola instrucción, y hacendo uso de una lista de diccionarios de `python`, mediante el objeto DBAPI de conexión

In [ ]:
resultado = conn.execute(estudiantes.insert(),[
  {'NOMBRE':'Paula','APELLIDO':'Mur'},
  {'NOMBRE':'Pablo','APELLIDO':'Bellido'},
  {'NOMBRE':'Paola','APELLIDO':'Larco'},
  {'NOMBRE':'Daniela','APELLIDO':'Diaz'},
])

2020-09-01 17:21:38,259 INFO sqlalchemy.engine.base.Engine INSERT INTO estudiantes ("NOMBRE", "APELLIDO") VALUES (?, ?)

INFO:sqlalchemy.engine.base.Engine:INSERT INTO estudiantes ("NOMBRE", "APELLIDO") VALUES (?, ?)

2020-09-01 17:21:38,263 INFO sqlalchemy.engine.base.Engine (('Paula', 'Mur'), ('Pablo', 'Bellido'), ('Paola', 'Larco'), ('Daniela', 'Diaz'))

INFO:sqlalchemy.engine.base.Engine:(('Paula', 'Mur'), ('Pablo', 'Bellido'), ('Paola', 'Larco'), ('Daniela', 'Diaz'))

2020-09-01 17:21:38,266 INFO sqlalchemy.engine.base.Engine COMMIT

INFO:sqlalchemy.engine.base.Engine:COMMIT

Cerramos la conexión:

In [ ]:
conn.close()

###**Selección de Filas**

Recordemos que el metodo `SELECT` de `SQL` nos permite construir una expresión de seleción para analizar algún dato de una tabla de bases de datos. En `SQLAlchemy`, la selección la construirmos a partir del objeto `estudiante`:

In [ ]:
sel = estudiantes.select() 
str(sel)

'SELECT estudiantes."ID", estudiantes."NOMBRE", estudiantes."APELLIDO" \nFROM estudiantes'

Usamos ahora el objeto de conexión `DBAPI` para seleccionar los elementos de la tabla de la base de datos; para este objetivo, en el argumento del método `execute()` el objeto creado `sel`

In [ ]:
conn = engine.connect()
resultado = conn.execute(sel)

2020-09-01 17:23:43,415 INFO sqlalchemy.engine.base.Engine SELECT estudiantes."ID", estudiantes."NOMBRE", estudiantes."APELLIDO"
FROM estudiantes

INFO:sqlalchemy.engine.base.Engine:SELECT estudiantes."ID", estudiantes."NOMBRE", estudiantes."APELLIDO"
FROM estudiantes

2020-09-01 17:23:43,417 INFO sqlalchemy.engine.base.Engine ()

INFO:sqlalchemy.engine.base.Engine:()

Que como vemos, ejecuta la expresión `SQL`:

```
SELECT estudiante.id, estudiante.nombre, estudiante.apellido 
FROM estudiante
```

La variable `resultado` es equivalente a un cursor en el objeto `DBAPI`. En este punto, podremos acceder a los registros usando el método `fetchall()`:

In [ ]:
filas = resultado.fetchall()
filas

[(1, 'Sebastian', 'Sanchez'),
 (2, 'Paula', 'Mur'),
 (3, 'Pablo', 'Bellido'),
 (4, 'Paola', 'Larco'),
 (5, 'Daniela', 'Diaz')]

cerramos conexión:

In [ ]:
conn.close()

De forma más expedita, podemos realizar lo siguiente:

In [ ]:
conn = engine.connect()
sel = estudiantes.select()
resultado = conn.execute(sel)

for filas in resultado:
  print(filas)

2020-09-01 17:25:02,361 INFO sqlalchemy.engine.base.Engine SELECT estudiantes."ID", estudiantes."NOMBRE", estudiantes."APELLIDO"
FROM estudiantes

INFO:sqlalchemy.engine.base.Engine:SELECT estudiantes."ID", estudiantes."NOMBRE", estudiantes."APELLIDO"
FROM estudiantes

2020-09-01 17:25:02,363 INFO sqlalchemy.engine.base.Engine ()

INFO:sqlalchemy.engine.base.Engine:()

(1, 'Sebastian', 'Sanchez')
(2, 'Paula', 'Mur')
(3, 'Pablo', 'Bellido')
(4, 'Paola', 'Larco')
(5, 'Daniela', 'Diaz')

Si queremos seleccionar unas cuantas filas, construyamos primero la expresión SQL. Para ello, importamos el metodo `select():`

In [ ]:
from sqlalchemy.sql import select

sel = select([estudiantes.c.NOMBRE, estudiantes.c.APELLIDO])
str(sel)

'SELECT estudiantes."NOMBRE", estudiantes."APELLIDO" \nFROM estudiantes'

Una vez construido, nos conectamos a la base de datos y hacemos la selección

In [ ]:
conn = engine.connect()
resultado = conn.execute(sel)
print(resultado.fetchall())

conn.close()

2020-09-01 17:47:42,919 INFO sqlalchemy.engine.base.Engine SELECT estudiantes."NOMBRE", estudiantes."APELLIDO"
FROM estudiantes

INFO:sqlalchemy.engine.base.Engine:SELECT estudiantes."NOMBRE", estudiantes."APELLIDO"
FROM estudiantes

2020-09-01 17:47:42,927 INFO sqlalchemy.engine.base.Engine ()

INFO:sqlalchemy.engine.base.Engine:()

[('Sebastian', 'Sanchez'), ('Paula', 'Mur'), ('Pablo', 'Bellido'), ('Paola', 'Larco'), ('Daniela', 'Diaz')]

####**Clausula `WHERE`**

La clausula `WHERE` de la consulta `SELECT` ser introducida usando `select().where()`. De la sección [SQL-WHERE](#WHERE), recordemos que esta clausula recibe un predicado que corresponde a un booleano. Por ejemplo, si queremos consultar todos los `ids` menores o iguales a 3:

In [ ]:
#conexión
conn = engine.connect()
sel = estudiantes.select().where(estudiantes.c.ID<=3)
resultado = conn.execute(sel)

for filas in resultado:
  print(filas)

conn.close()

2020-09-01 17:50:44,386 INFO sqlalchemy.engine.base.Engine SELECT estudiantes."ID", estudiantes."NOMBRE", estudiantes."APELLIDO"
FROM estudiantes
WHERE estudiantes."ID" <= ?

INFO:sqlalchemy.engine.base.Engine:SELECT estudiantes."ID", estudiantes."NOMBRE", estudiantes."APELLIDO"
FROM estudiantes
WHERE estudiantes."ID" <= ?

2020-09-01 17:50:44,390 INFO sqlalchemy.engine.base.Engine (3,)

INFO:sqlalchemy.engine.base.Engine:(3,)

(1, 'Sebastian', 'Sanchez')
(2, 'Paula', 'Mur')
(3, 'Pablo', 'Bellido')

El atributo `c` es un alias para columnas.

###**Uso de texto en `SQLAlchemy`**

`SQLAlchemy` nos permite usar cadenas de texto en los casos en que se conoce el `SQL` y no existe mayor necesidad de que la declaración admita caractarísticas dinámicas. La construcción de `text()` se usa para componer una declaración textual que se pasa a la base de datos, casi sin cambios:

In [ ]:
from sqlalchemy import text 
conn = engine.connect()
my_text = text("SELECT * FROM estudiantes")# Esto es muy cómodo
resultado = conn.execute(my_text)

for filas in resultado:
  print(filas)

conn.close()

2020-09-01 17:52:41,655 INFO sqlalchemy.engine.base.Engine SELECT * FROM estudiantes

INFO:sqlalchemy.engine.base.Engine:SELECT * FROM estudiantes

2020-09-01 17:52:41,660 INFO sqlalchemy.engine.base.Engine ()

INFO:sqlalchemy.engine.base.Engine:()

(1, 'Sebastian', 'Sanchez')
(2, 'Paula', 'Mur')
(3, 'Pablo', 'Bellido')
(4, 'Paola', 'Larco')
(5, 'Daniela', 'Diaz')

Veamos un ejemplo en donde usamos parametros de límites en SQL:

In [ ]:
conn = engine.connect()

t = text("select estudiantes.NOMBRE, estudiantes.APELLIDO from estudiantes where estudiantes.NOMBRE between :x and :y")
resultado = conn.execute(t, x = 'B', y = 'Q')

for filas in resultado:
  print(filas)

conn.close()

2020-09-01 17:54:10,441 INFO sqlalchemy.engine.base.Engine select estudiantes.NOMBRE, estudiantes.APELLIDO from estudiantes where estudiantes.NOMBRE between ? and ?

INFO:sqlalchemy.engine.base.Engine:select estudiantes.NOMBRE, estudiantes.APELLIDO from estudiantes where estudiantes.NOMBRE between ? and ?

2020-09-01 17:54:10,443 INFO sqlalchemy.engine.base.Engine ('B', 'Q')

INFO:sqlalchemy.engine.base.Engine:('B', 'Q')

('Paula', 'Mur')
('Pablo', 'Bellido')
('Paola', 'Larco')
('Daniela', 'Diaz')

###**Aliases**

Los alias en `SQL` corresponden nick o "renombre" de una tabla, o una instrucción `SELECT`, que se puede hacer, de forma general, como

```
SELECT * FROM table1 AS a"
```

De esta forma, `AS` crea un nuevo nombre para la tabla. Los alias nos permiten cear un nombre único para cualquier tabla o subconsulta.

In [ ]:
from sqlalchemy.sql import alias, select

#Conexión
conn = engine.connect()

#Alias
es = estudiantes.alias("a")
sel = select([es]).where(es.c.ID>=2)
print("Apariencia de la selección:", str(sel))
conn = engine.connect()
print(conn.execute(sel).fetchall())

conn.close()

Apariencia de la selección: SELECT a."ID", a."NOMBRE", a."APELLIDO"
FROM estudiantes AS a
WHERE a."ID" >= :ID_1
2020-09-01 17:57:28,380 INFO sqlalchemy.engine.base.Engine SELECT a."ID", a."NOMBRE", a."APELLIDO"
FROM estudiantes AS a
WHERE a."ID" >= ?

INFO:sqlalchemy.engine.base.Engine:SELECT a."ID", a."NOMBRE", a."APELLIDO"
FROM estudiantes AS a
WHERE a."ID" >= ?

2020-09-01 17:57:28,383 INFO sqlalchemy.engine.base.Engine (2,)

INFO:sqlalchemy.engine.base.Engine:(2,)

[(2, 'Paula', 'Mur'), (3, 'Pablo', 'Bellido'), (4, 'Paola', 'Larco'), (5, 'Daniela', 'Diaz')]

###**Expresión `UPDATE`**

El método `update()` sobre un objeto tabla construye una expresión equivalente en SQL:

```
table.update().where(condiciones).values(SET expresiones)
```

El método `values()` del objeto resultante `update()` se usa para especificar las condiciones de `SET` del UPDATE (ver sección [Update-Delete](#update_delete)). Si se deja como `None`, las condiciones de `SET` son determinadas de los parámetros que se pasan a la declaración durante la ejecución y/o complilación de la instrucción.


La clausula `where` es una expresión opcional que describe la condición `WHERE` de la declaración `UPDATE`.

Por ejemplo, supongamos que el apellido `Sanchez` de la primera entrada de la tabla estudiante es incorrecto, y en su lugar, debería ir `Pineda`. Para este fin hacemos lo siguiente:

In [ ]:
from sqlalchemy import update

#Conexión
conn = engine.connect()

#Instrucción
stmt = update(estudiantes).where(estudiantes.c.APELLIDO=="Mur").values(APELLIDO="Lopez")
conn.execute(stmt)

#Selección para visualización
sel = estudiantes.select()
print(conn.execute(sel).fetchall())

conn.close()

2020-09-01 17:59:34,899 INFO sqlalchemy.engine.base.Engine UPDATE estudiantes SET "APELLIDO"=? WHERE estudiantes."APELLIDO" = ?

INFO:sqlalchemy.engine.base.Engine:UPDATE estudiantes SET "APELLIDO"=? WHERE estudiantes."APELLIDO" = ?

2020-09-01 17:59:34,901 INFO sqlalchemy.engine.base.Engine ('Lopez', 'Mur')

INFO:sqlalchemy.engine.base.Engine:('Lopez', 'Mur')

2020-09-01 17:59:34,907 INFO sqlalchemy.engine.base.Engine COMMIT

INFO:sqlalchemy.engine.base.Engine:COMMIT

2020-09-01 17:59:34,917 INFO sqlalchemy.engine.base.Engine SELECT estudiantes."ID", estudiantes."NOMBRE", estudiantes."APELLIDO"
FROM estudiantes

INFO:sqlalchemy.engine.base.Engine:SELECT estudiantes."ID", estudiantes."NOMBRE", estudiantes."APELLIDO"
FROM estudiantes

2020-09-01 17:59:34,920 INFO sqlalchemy.engine.base.Engine ()

INFO:sqlalchemy.engine.base.Engine:()

[(1, 'Sebastian', 'Sanchez'), (2, 'Paula', 'Lopez'), (3, 'Pablo', 'Bellido'), (4, 'Paola', 'Larco'), (5, 'Daniela', 'Diaz')]

Otra forma de hacer está operación sería:

In [ ]:
#Conexión
conn = engine.connect()

# Instrucción
stmt = estudiantes.update().where(estudiantes.c.APELLIDO=="Lopez").values(APELLIDO="Giraldo")
conn.execute(stmt)

#Selección para visualización
sel = estudiantes.select()
print(conn.execute(sel).fetchall())

#Cerrar
conn.close()

2020-09-01 18:01:04,779 INFO sqlalchemy.engine.base.Engine UPDATE estudiantes SET "APELLIDO"=? WHERE estudiantes."APELLIDO" = ?

INFO:sqlalchemy.engine.base.Engine:UPDATE estudiantes SET "APELLIDO"=? WHERE estudiantes."APELLIDO" = ?

2020-09-01 18:01:04,781 INFO sqlalchemy.engine.base.Engine ('Giraldo', 'Lopez')

INFO:sqlalchemy.engine.base.Engine:('Giraldo', 'Lopez')

2020-09-01 18:01:04,784 INFO sqlalchemy.engine.base.Engine COMMIT

INFO:sqlalchemy.engine.base.Engine:COMMIT

2020-09-01 18:01:04,802 INFO sqlalchemy.engine.base.Engine SELECT estudiantes."ID", estudiantes."NOMBRE", estudiantes."APELLIDO"
FROM estudiantes

INFO:sqlalchemy.engine.base.Engine:SELECT estudiantes."ID", estudiantes."NOMBRE", estudiantes."APELLIDO"
FROM estudiantes

2020-09-01 18:01:04,803 INFO sqlalchemy.engine.base.Engine ()

INFO:sqlalchemy.engine.base.Engine:()

[(1, 'Sebastian', 'Sanchez'), (2, 'Paula', 'Giraldo'), (3, 'Pablo', 'Bellido'), (4, 'Paola', 'Larco'), (5, 'Daniela', 'Diaz')]

###**Expresión `DELETE`**

Similar a la sección anterior, una operación `delete()` puede realizarse mediante el método `delete()` en un objeto tabla mediante la siguiente instrucción:

In [ ]:
stmt = estudiantes.delete()
# Función SQL
str(stmt)

'DELETE FROM estudiantes'

Este comando eliminaría todas las entradas de la tabla. Eliminemos, por ejemplo la entrada con `id==1`.

In [ ]:
stmt = estudiantes.delete().where(estudiantes.c.ID==1)
str(stmt)

'DELETE FROM estudiantes WHERE estudiantes."ID" = :ID_1'

In [ ]:
#Conexión
conn = engine.connect()

#Instrucción
stmt = estudiantes.delete().where(estudiantes.c.ID==1)
conn.execute(stmt)

#Selección para visualizar cambio
sel = estudiantes.select()
print(conn.execute(sel).fetchall())

#Cierre conexión
conn.close()

2020-09-01 18:04:22,345 INFO sqlalchemy.engine.base.Engine DELETE FROM estudiantes WHERE estudiantes."ID" = ?

INFO:sqlalchemy.engine.base.Engine:DELETE FROM estudiantes WHERE estudiantes."ID" = ?

2020-09-01 18:04:22,347 INFO sqlalchemy.engine.base.Engine (1,)

INFO:sqlalchemy.engine.base.Engine:(1,)

2020-09-01 18:04:22,350 INFO sqlalchemy.engine.base.Engine COMMIT

INFO:sqlalchemy.engine.base.Engine:COMMIT

2020-09-01 18:04:22,367 INFO sqlalchemy.engine.base.Engine SELECT estudiantes."ID", estudiantes."NOMBRE", estudiantes."APELLIDO"
FROM estudiantes

INFO:sqlalchemy.engine.base.Engine:SELECT estudiantes."ID", estudiantes."NOMBRE", estudiantes."APELLIDO"
FROM estudiantes

2020-09-01 18:04:22,371 INFO sqlalchemy.engine.base.Engine ()

INFO:sqlalchemy.engine.base.Engine:()

[(2, 'Paula', 'Giraldo'), (3, 'Pablo', 'Bellido'), (4, 'Paola', 'Larco'), (5, 'Daniela', 'Diaz')]

##**Taller de creación y manipulación de bases de datos:**

En los equipos conformados en clase, cree una base de datos de una sola entidad o tabla usando `sqlalchemy` y motor de base de datos `sqlite`. En el ejercicio se deben tener en cuenta los siguientes pasos

1. Creación de la base de datos.
2. Inserción de instancias en dicha base de datos.
3. Selección de algunos datos para visualizar.
4. Selección de de datos mediante la clausula `WHERE`.
5. Actualización de datos.
6. Inserción de nuevos elementos y establecimiento de un criterio para luego borrarlos. 

**Nota:** En cada uno de los pasos deberá visualizar los resultados obtenidos.

##**`SQLAlchemy` Core: Tablas múltiples**

###**Creación de tablas múltiples relacionadas:**

A continuación se muestra el proceso de creación de tablas múltiples, en donde se permite, por ejemple, el establecimiento de relaciones entre dos o más tablas.

In [ ]:
rm inmuebles_multi_tablas.db

In [ ]:
from sqlalchemy import create_engine, MetaData, Table, Column, Integer, String, ForeignKey
engine = create_engine('sqlite:///inmuebles_multi_tablas.db', echo=True)
meta = MetaData()

propietarios = Table(
   'propietarios', meta, 
   Column('id', Integer, primary_key = True), 
   Column('nombre', String), 
   Column('apellido', String), 
)

casas = Table(
   'casas', meta, 
   Column('id', Integer, primary_key = True), 
   Column('prop_id', Integer, ForeignKey('propietarios.id')), 
   Column('barrio', String), 
   Column('estrato', Integer))

meta.create_all(engine)

2020-08-27 19:44:04,433 INFO sqlalchemy.engine.base.Engine SELECT CAST('test plain returns' AS VARCHAR(60)) AS anon_1
2020-08-27 19:44:04,435 INFO sqlalchemy.engine.base.Engine ()
2020-08-27 19:44:04,438 INFO sqlalchemy.engine.base.Engine SELECT CAST('test unicode returns' AS VARCHAR(60)) AS anon_1
2020-08-27 19:44:04,439 INFO sqlalchemy.engine.base.Engine ()
2020-08-27 19:44:04,441 INFO sqlalchemy.engine.base.Engine PRAGMA main.table_info("propietarios")
2020-08-27 19:44:04,442 INFO sqlalchemy.engine.base.Engine ()
2020-08-27 19:44:04,444 INFO sqlalchemy.engine.base.Engine PRAGMA temp.table_info("propietarios")
2020-08-27 19:44:04,446 INFO sqlalchemy.engine.base.Engine ()
2020-08-27 19:44:04,447 INFO sqlalchemy.engine.base.Engine PRAGMA main.table_info("casas")
2020-08-27 19:44:04,448 INFO sqlalchemy.engine.base.Engine ()
2020-08-27 19:44:04,450 INFO sqlalchemy.engine.base.Engine PRAGMA temp.table_info("casas")
2020-08-27 19:44:04,451 INFO sqlalchemy.engine.base.Engine ()
2020-08-27 19:44:04,454 INFO sqlalchemy.engine.base.Engine
CREATE TABLE propietarios (
	id INTEGER NOT NULL,
	nombre VARCHAR,
	apellido VARCHAR,
	PRIMARY KEY (id)
)


2020-08-27 19:44:04,455 INFO sqlalchemy.engine.base.Engine ()
2020-08-27 19:44:04,471 INFO sqlalchemy.engine.base.Engine COMMIT
2020-08-27 19:44:04,476 INFO sqlalchemy.engine.base.Engine
CREATE TABLE casas (
	id INTEGER NOT NULL,
	prop_id INTEGER,
	barrio VARCHAR,
	estrato INTEGER,
	PRIMARY KEY (id),
	FOREIGN KEY(prop_id) REFERENCES propietarios (id)
)


2020-08-27 19:44:04,478 INFO sqlalchemy.engine.base.Engine ()
2020-08-27 19:44:04,494 INFO sqlalchemy.engine.base.Engine COMMIT

In [ ]:
ls -la

total 28
drwxr-xr-x 1 root root  4096 Aug 27 19:44 ./
drwxr-xr-x 1 root root  4096 Aug 27 13:06 ../
drwxr-xr-x 1 root root  4096 Aug 24 16:35 .config/
-rw-r--r-- 1 root root 12288 Aug 27 19:44 inmuebles_multi_tablas.db
drwxr-xr-x 1 root root  4096 Aug 24 16:35 sample_data/

In [ ]:
meta.tables

immutabledict({'propietarios': Table('propietarios', MetaData(bind=None), Column('id', Integer(), table=<propietarios>, primary_key=True, nullable=False), Column('nombre', String(), table=<propietarios>), Column('apellido', String(), table=<propietarios>), schema=None), 'casas': Table('casas', MetaData(bind=None), Column('id', Integer(), table=<casas>, primary_key=True, nullable=False), Column('prop_id', Integer(), ForeignKey('propietarios.id'), table=<casas>), Column('barrio', String(), table=<casas>), Column('estrato', Integer(), table=<casas>), schema=None)})

Rellenemos ahora, las tablas con algunos datos:

In [ ]:
# Objeto conexión DBAPI
conn = engine.connect()

# Inserción datos tabla estudiantes
conn.execute(propietarios.insert(), [
   {'nombre':'Sebastian', 'apellido':'Sanchez'},
   {'nombre':'Pablo', 'apellido' : 'Bellido'},
   {'nombre':'Paula','apellido' : 'Mur'},
   {'nombre':'Paola','apellido' : 'Larco'},
   {'nombre':'Daniela','apellido' : 'Diaz'},
])

#Inserción datos tabla direcciones
conn.execute(casas.insert(), [
   {'prop_id':1, 'barrio':'Laureles', 'estrato':4},
   {'prop_id':1, 'barrio':'Manila', 'estrato':5},
   {'prop_id':3, 'barrio':'Aranjuez', 'estrato':3},
   {'prop_id':5, 'barrio':'San Javier', 'estrato':2},
   {'prop_id':2, 'barrio':'Belen', 'estrato':4},
])

2020-08-27 19:44:32,250 INFO sqlalchemy.engine.base.Engine INSERT INTO propietarios (nombre, apellido) VALUES (?, ?)
2020-08-27 19:44:32,252 INFO sqlalchemy.engine.base.Engine (('Sebastian', 'Sanchez'), ('Pablo', 'Bellido'), ('Paula', 'Mur'), ('Paola', 'Larco'), ('Daniela', 'Diaz'))
2020-08-27 19:44:32,254 INFO sqlalchemy.engine.base.Engine COMMIT
2020-08-27 19:44:32,270 INFO sqlalchemy.engine.base.Engine INSERT INTO casas (prop_id, barrio, estrato) VALUES (?, ?, ?)
2020-08-27 19:44:32,271 INFO sqlalchemy.engine.base.Engine ((1, 'Laureles', 4), (1, 'Manila', 5), (3, 'Aranjuez', 3), (5, 'San Javier', 2), (2, 'Belen', 4))
2020-08-27 19:44:32,273 INFO sqlalchemy.engine.base.Engine COMMIT

Tengamos en cuenta que la columna `prop_id` en la tabla `casas` se refiere al `id` de la columna en la tabla `estudiantes`. Podemos usar esta relación para obtener datos de ambas tablas.

Supongamos, por emplo, que deseamos obtener el nombre y el apellido de la tabla de estudiantes correspondientes al `est_id` de la tabla de direcciones:

In [ ]:
from sqlalchemy.sql import select

sel = select([propietarios]).where(propietarios.c.id==casas.c.prop_id)
resultado = conn.execute(sel)

for filas in resultado:
  print(filas)

2020-08-27 19:50:53,196 INFO sqlalchemy.engine.base.Engine SELECT propietarios.id, propietarios.nombre, propietarios.apellido
FROM propietarios, casas
WHERE propietarios.id = casas.prop_id
2020-08-27 19:50:53,197 INFO sqlalchemy.engine.base.Engine ()
(1, 'Sebastian', 'Sanchez')
(1, 'Sebastian', 'Sanchez')
(3, 'Paula', 'Mur')
(5, 'Daniela', 'Diaz')
(2, 'Pablo', 'Bellido')

En donde la instrucción en `SQL` es:

In [ ]:
str(sel)

'SELECT estudiantes.id, estudiantes.nombre, estudiantes.apellido, direcciones.id, direcciones.est_id, direcciones.barrio, direcciones.correo \nFROM estudiantes, direcciones \nWHERE estudiantes.id = direcciones.est_id'

O de forma más organizada:

```
SELECT estudiantes.id, 
  estudiantes.nombre, 
  estudiantes.apellido, 
  direcciones.id, 
  direcciones.est_id, 
  direcciones.barrio, 
  direcciones.correo 
FROM estudiantes, direcciones 
WHERE estudiantes.id = direcciones.est_id
```

# **H. `sqlalchemy` y `flask`:**

Para trabajar con bases de datos en `Python` tenemos varias opciones:

1. Uso de sistemas de manejo de bases de datos relacionales (RDBMS) embebidos como `sqlite3`, `mysql-connector-python` o `psycopg2` de PostgreSQL. Por ejemplo, el uso de `sqlite3` se asemejaría mucho a `SQL`.

2. El uso de "Mapeadores de Objetos Relacionales" (ORM - Object-Relational Mappres) que corresponden a capas abstractas de bases de datos donde **se usan objetos  regulares de `Python` en lugar de entidades de bases de datos como tablas**. En el caso de `SQL` en `python` tenemos en `SQLAlchemy`. Para realizar alguna de este consulta de este toolkit podemos acceder a este [link](https://www.sqlalchemy.org/). Por otra parte, dado que trabajaremos con aplicaciones web, nos remitiremos a la extensión `flask_sqlalchemy` que soporta `SQLAlchemy` en apps ([ver link](https://flask-sqlalchemy.palletsprojects.com/en/2.x/)).

##**Instalación de los paquetes necesarios**

El primer paso consistiría en instalar los paquenes necesarios para trabajar con bases de datos SQL:

In [ ]:
!pip install SQLAlchemy
!pip install flask_sqlalchemy
!pip install flask_ngrok

Requirement already satisfied: SQLAlchemy in /usr/local/lib/python3.6/dist-packages (1.3.19)
Requirement already satisfied: flask_sqlalchemy in /usr/local/lib/python3.6/dist-packages (2.4.4)
Requirement already satisfied: SQLAlchemy>=0.8.0 in /usr/local/lib/python3.6/dist-packages (from flask_sqlalchemy) (1.3.19)
Requirement already satisfied: Flask>=0.10 in /usr/local/lib/python3.6/dist-packages (from flask_sqlalchemy) (1.1.2)
Requirement already satisfied: click>=5.1 in /usr/local/lib/python3.6/dist-packages (from Flask>=0.10->flask_sqlalchemy) (7.1.2)
Requirement already satisfied: Werkzeug>=0.15 in /usr/local/lib/python3.6/dist-packages (from Flask>=0.10->flask_sqlalchemy) (1.0.1)
Requirement already satisfied: Jinja2>=2.10.1 in /usr/local/lib/python3.6/dist-packages (from Flask>=0.10->flask_sqlalchemy) (2.11.2)
Requirement already satisfied: itsdangerous>=0.24 in /usr/local/lib/python3.6/dist-packages (from Flask>=0.10->flask_sqlalchemy) (1.1.0)
Requirement already satisfied: MarkupSafe>=0.23 in /usr/local/lib/python3.6/dist-packages (from Jinja2>=2.10.1->Flask>=0.10->flask_sqlalchemy) (1.1.1)
Requirement already satisfied: flask_ngrok in /usr/local/lib/python3.6/dist-packages (0.0.25)
Requirement already satisfied: requests in /usr/local/lib/python3.6/dist-packages (from flask_ngrok) (2.23.0)
Requirement already satisfied: Flask>=0.8 in /usr/local/lib/python3.6/dist-packages (from flask_ngrok) (1.1.2)
Requirement already satisfied: urllib3!=1.25.0,!=1.25.1,<1.26,>=1.21.1 in /usr/local/lib/python3.6/dist-packages (from requests->flask_ngrok) (1.24.3)
Requirement already satisfied: idna<3,>=2.5 in /usr/local/lib/python3.6/dist-packages (from requests->flask_ngrok) (2.10)
Requirement already satisfied: chardet<4,>=3.0.2 in /usr/local/lib/python3.6/dist-packages (from requests->flask_ngrok) (3.0.4)
Requirement already satisfied: certifi>=2017.4.17 in /usr/local/lib/python3.6/dist-packages (from requests->flask_ngrok) (2020.6.20)
Requirement already satisfied: Werkzeug>=0.15 in /usr/local/lib/python3.6/dist-packages (from Flask>=0.8->flask_ngrok) (1.0.1)
Requirement already satisfied: Jinja2>=2.10.1 in /usr/local/lib/python3.6/dist-packages (from Flask>=0.8->flask_ngrok) (2.11.2)
Requirement already satisfied: itsdangerous>=0.24 in /usr/local/lib/python3.6/dist-packages (from Flask>=0.8->flask_ngrok) (1.1.0)
Requirement already satisfied: click>=5.1 in /usr/local/lib/python3.6/dist-packages (from Flask>=0.8->flask_ngrok) (7.1.2)
Requirement already satisfied: MarkupSafe>=0.23 in /usr/local/lib/python3.6/dist-packages (from Jinja2>=2.10.1->Flask>=0.8->flask_ngrok) (1.1.1)

In [ ]:
!rm app_db.py db_test.db

In [ ]:
file = open("app_db.py","w")
file.write('''from flask import Flask
from flask_sqlalchemy import SQLAlchemy

app = Flask(__name__)
app.config["SQLALCHEMY_DATABASE_URI"]="sqlite:////content/db_test.db"
app.config["SQLALCHEMY_TRACK_MODIFICATIONS"] = False
db = SQLAlchemy(app)

class User(db.Model):
    id = db.Column(db.Integer, primary_key=True)
    username = db.Column(db.String(80), unique=True, nullable=False)
    email = db.Column(db.String(120), unique=True, nullable=False)

    def __repr__(self):
        return '<User %r>' % self.username

#app.run()
#db.init_app(app)
''')

file.close()

In [ ]:
ls

app_db.py  __pycache__/  sample_data/

In [ ]:
from app_db import db
db.create_all()

In [ ]:
ls

app_db.py  db_test.db  __pycache__/  sample_data/

In [ ]:
# Insert element
from app import User
usuarioA = User(username="Sebastian", email = "ssanchez2@eafit.edu.co")
db.session.add(usuarioA)
db.session.commit()

In [ ]:
import sqlalchemy

In [ ]:
ls

__pycache__/  sample_data/